{
    "date": "September 16th, 2015",
    "title": "(0Day) Avira Management Console Update Manager Service HTTP Header Use-After-Free Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-445",
    "ID_2": "ZDI-CAN-3118",
    "cveId": "CVE-2015-7303",
    "baseScore": "9.3",
    "vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
    "vendors": "Avira",
    "products": "Management Console",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Avira Management Console. Authentication is not required to exploit this vulnerability. \nThe specific flaw exists within the handling of HTTP headers by the Update Manager service. By sending overly large headers, an attacker is able to cause memory to be reused after it has been released. An attacker could leverage this to execute arbitrary code under the context of SYSTEM.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\n09/03/2015 - ZDI emailed Avira contact and requested contact09/13/2015 - ZDI emailed Avira security@, secure@, support@ and requested contact09/13/2015 - Avira replied that the product is nearing EOL and would not be patched09/14/2015 - ZDI notified the vendor of intent to publish as 0-day\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n-- Vendor Patch:\n\nhttp://www.avira.com/en/support-for-home-knowledgebase-detail/kbid/1787\n\n      ",
    "timeline": "2015-05-19 - Vulnerability reported to vendor\n2015-09-16 - Coordinated public release of advisory",
    "credit": "rgod"
}