{
    "date": "December 14th, 2015",
    "title": "(0Day) Apache TomEE Deserialization of Untrusted Data Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-638",
    "ID_2": "ZDI-CAN-2929",
    "cveId": "CVE-2015-8581",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "",
    "products": "TomEE",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Apache TomEE. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the EjbObjectInputStream which accepts and deserializes any Java serialized binary stream.  An attacker can leverage this vulnerability to  execute arbitrary code under the context of the process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n05/20/2015 - ZDI disclosed vulnerability details to the vendor.  ZDI received no reply at that time.09/28/2015 - ZDI requested an update from the vendor.09/30/2015 - The vendor confirmed they had received the report, but they could not provide a status.10/03/2015 - ZDI again requested any update from the vendor.10/14/2015 - ZDI indicated the intent to move the case to 0-day in late Nov.10/14 - 17/2015 - The vendor asked some questions about the report and requested an additional file.10/16 - 19/2015 - ZDI responded and provided evidence.11/09/2015 - ZDI requested an update from the vendor and indicated the intent to move the case to 0-day in late Nov.12/10/2015 - ZDI saw an update to the product and re-tested.  However, the software remains vulnerable.\n\n-- Mitigation:\n\nGiven the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n      ",
    "timeline": "2015-05-20 - Vulnerability reported to vendor\n2015-12-14 - Coordinated public release of advisory",
    "credit": "cpnrodzc7"
}