{
    "date": "December 14th, 2015",
    "title": "(0Day) Microsoft Office Excel Binary Worksheet Use-After-Free Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-639",
    "ID_2": "ZDI-CAN-3269",
    "cveId": "CVE-2016-0035",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "Microsoft",
    "products": "Office Excel",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Microsoft Office Excel. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the handling of binary Excel files (.xlsb). By providing a malformed file, an attacker can cause a pointer to be re-used after it has been freed. An attacker could leverage this to execute arbitrary code under the context of the current user.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n09/08/2015 - ZDI disclosed vulnerability details to the vendor 09/09/2015 - The vendor acknowledged with a case assignment09/09/2015 - The vendor sent a question about the user notification experience09/14/2015 - ZDI replied that the the user has to attempt to recover the data10/08/2015 - The vendor notified ZDI that the case was \"heading towards closure\" and that it is same issue to (XXXXX, previous resolved case)11/17/2015 - ZDI notified the vendor that the case still hits (post XXXXX previous case patch)11/24/2015 - The vendor replied they would look into it12/02/2015 - The vendor replied that:  We took a defense in depth approach to (XXXXX, previous resolved case) and made code improvements that we believed would also mitigate (this case). While (this case) still crashes, it does so only after the user has accepted the risk.  As such we will resolve (this case) as \"won't fix\".12/17/2015 - The vendor has re-evaluated their stance and will be working on a fix.\n\n-- Mitigation:\n\nGiven the stated purpose of Microsoft Office Excel, and the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application to trusted files.\n\n-- Vendor Response Link:\n\nhttps://technet.microsoft.com/library/security/MS16-004\n\n      ",
    "timeline": "2015-09-08 - Vulnerability reported to vendor\n2015-12-14 - Coordinated public release of advisory",
    "credit": "Steven Seeley of Source Incite"
}