{
    "date": "February 27th, 2015",
    "title": "(0Day) Microsoft Word Line Formatting Denial of Service Vulnerability",
    "ID_1": "ZDI-15-052",
    "ID_2": "ZDI-CAN-2485",
    "cveId": "",
    "baseScore": "4.3",
    "vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:P",
    "vendors": "Microsoft",
    "products": "Office Word",
    "description": "    This vulnerability allows remote attackers to create a denial of service condition on vulnerable installations of Microsoft Word. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the line formatting functionality. By providing a malformed .docx file, an attacker can cause a denial of service condition for the current user.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n08/04/2014 - Report sent to vendor08/04/2014 - ZDI received reply and case # from the vendor01/13/2015 - ZDI requested any available update or ETA - no reply01/21/2015 - ZDI notified of possible 0-day - no reply02/09/2015 - ZDI notified the vendor that the case will-move to 0-day and is no longer eligible for extension02/27/2015 - ZDI publishes advisory.03/02/2015 - After multiple mails with no reply from this vendor prior to this 0-day posting, the ZDI did receive a post 0-day response from this vendor.  The vendor notified that the case was closed previously and acknowledged that they failed to notify the ZDI at that time.  Advisory updated based on feedback from vendor.\n\n-- Vendor Mitigation:\n\nThe vendor did not provide any mitigations.\n\n-- Mitigation:\n\nGiven the stated purpose of Microsoft Word, and the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application to trusted files.\n\n      ",
    "timeline": "2014-08-04 - Vulnerability reported to vendor\n2015-02-27 - Coordinated public release of advisory",
    "credit": "Alisa Esage"
}