{
    "date": "October 13th, 2015",
    "title": "(0Day) Samsung SmartViewer STWAxConfig DVRSetupSave Untrusted Pointer Dereference Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-462",
    "ID_2": "ZDI-CAN-2710",
    "cveId": "CVE-2015-8039",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "",
    "products": "SmartViewer",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Samsung SmartViewer. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the STWAxConfig control's DVRSetupSave method. The control contains an untrusted pointer dereference vulnerability. It dereferences an attacker-supplied memory address. An attacker can exploit this condition to achieve code execution under the context of the browser process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\n02/04/2015 - ZDI disclosed vulnerability details to the vendor (ZDI sent to known contacts, but received no initial ACK)05/14/2015 - ZDI requested any available update from the vendor09/28/2015 - ZDI sent multiple requests to multiple parties with the vendor requesting any available update09/29/2015 - The vendor replied they could not decrypt the request10/02/2015 - ZDI replied without decryption simply asking the status of the report \n\n-- Mitigation:\n\nThe killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibility Flags DWORD within the following location in the registry:\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\17A7F731-C9EC-461C-B813-2F42A1BB58EB\n\nIf the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797\n\n-- Vendor Mitigation:\n\nWe have resolved below issues as removing DVR setup function of N company.\n\nResolved Version :  SmartViewer v4.6.0 (August 2015) ~ v4.9.1 (Current Final Version)\n\n      ",
    "timeline": "2015-02-04 - Vulnerability reported to vendor\n2015-10-13 - Coordinated public release of advisory",
    "credit": "Ariele Caltabiano (kimiya)"
}