{
    "date": "July 20th, 2015",
    "title": "(0Day) Microsoft Internet Explorer CCurrentStyle Use-After-Free Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-361",
    "ID_2": "ZDI-CAN-2694",
    "cveId": "",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "Microsoft",
    "products": "Internet Explorer Mobile",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Microsoft Internet Explorer. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the handling of CCurrentStyle objects. By manipulating a document's elements an attacker can force a dangling pointer to be reused after it has been freed. An attacker can leverage this vulnerability to execute code under the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n01/20/15 - ZDI disclosed to the vendor01/20/15 - The vendor acknowledged3/5/2015 - The vendor requested an extension to 07/19/20153/5/2015 - ZDI agreed to an extension to 07/19/201507/02/2015 and 07/06/2015 - ZDI requested a status update07/06/2015 - The vendor replied with an expected build, but not a date07/06/2015 - ZDI notified of the intent to 0-day the week of 07/20/2015\n\n-- Mitigation:- In a web-based attack scenario, an attacker could host a specially crafted website that is designed to exploit these vulnerabilities through Internet Explorer, and then convince a user to view the website. The attacker could also take advantage of compromised websites and websites that accept or host user-provided content or advertisements. These websites could contain specially crafted content that could exploit these vulnerabilities. In all cases, however, an attacker would have no way to force users to view the attacker-controlled content. Instead, an attacker would have to convince users to take action, typically by getting them to click a link in an email message or in an Instant Messenger message that takes users to the attacker's website, or by getting them to open an attachment sent through email.\n\n- Configure Internet Explorer to prompt before running Active Scripting or to disable Active Scripting in the Internet and Local intranet security zone\n\n      ",
    "timeline": "2015-01-20 - Vulnerability reported to vendor\n2015-07-20 - Coordinated public release of advisory",
    "credit": "AbdulAziz Hariri - HP Zero Day Initiative"
}