{
    "date": "February 27th, 2015",
    "title": "(0Day) WebGate eDVR Manager WESPPTZ.WESPPTZCtrl.1 Connect/ConnectEx Heap Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-061",
    "ID_2": "ZDI-CAN-2124",
    "cveId": "CVE-2015-2098",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "WebGate",
    "products": "eDVR Manager",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of WebGate eDVR Manager. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the WESPPTZ.WESPPTZCtrl.1 control. The Connect and ConnectEx methods copy arbitrary data to a fixed-size heap buffer. This would allow an attacker to execute arbitrary code in the context of the browser.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n02/10/2014 - ZDI sent email to vendor requesting contact for disclosure02/18/2014 - ZDI sent email to vendor requesting contact for disclosure03/07/2014 - ZDI requested ICS-CERT assistance contacting the vendor03/08/2014 - ZDI disclosed this case to ICS-CERT05/12/2014 - ICS-CERT replied \"We do not consider the WebGate eDVR Manager to be an element of control systems or of critical infrastructure, so we have forwarded these reports on to our friends at CERT/CC.\"ZDI has since sent multiple mails to ICS-CERT, CERT/CC and kn-cert@ncsc.go.kr regarding Webgate cases in general.  However, to ZDI's knowledge, this has not resulted in any vendor response.\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibility Flags DWORD within the following location in the registry:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\359742AF-BF34-4379-A084-B7BF0E5F34B0If the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797\n\n      ",
    "timeline": "2014-02-10 - Vulnerability reported to vendor\n2015-02-27 - Coordinated public release of advisory",
    "credit": "rgod"
}