{
    "date": "February 27th, 2015",
    "title": "(0Day) WebGate WebEyeAudio.OCX Stack Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-15-054",
    "ID_2": "ZDI-CAN-2092",
    "cveId": "CVE-2015-2093",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "WebGate",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of the WebGate WebEyeAudio ActiveX control. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the Connect method provided by the control. By providing a malicious value, an attacker is able to overflow a static buffer on the stack, and could execute arbitrary code in the context of the browser.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n12/20/2013 - ZDI disclosed this case to ICS-CERT12/23/2013 - ICS-CERT replied with a ticket number and a message that \"We have sent your report to our partners at CERT/CC because the WebGate Web Camera is not an industial control system product.  CERT/CC will coordinate with the affected vendor and update you as progress is made.\"05/30/2014 - ZDI notified ICS-CERT, CERT/CC that the case would reach 180-days on 06/18/1406/16/2014 - ZDI re-notified ICS-CERT, CERT/CC of 180-day deadline07/18/2014 - ICS-CERT copied ZDI on re-ping of CERT/CC08/06/2014 - ICS-CERT notified ZDI that CERT/CC sent the case to Korea's CERTZDI has since sent multiple mails to ICS-CERT, CERT/CC and kn-cert@ncsc.go.kr regarding Webgate cases in general.  However, to ZDI's knowledge, this has not resulted in any vendor response.\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibility Flags DWORD within the following location in the registry:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\317AC6BB-6E8E-11D4-9BF0-005004BBFC86If the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797\n\n      ",
    "timeline": "2013-12-20 - Vulnerability reported to vendor\n2015-02-27 - Coordinated public release of advisory",
    "credit": "Anonymous"
}