{
  "schema_version": "1.4.0",
  "id": "GHSA-c2p2-hgjg-9r3f",
  "modified": "2025-02-12T21:05:47Z",
  "published": "2025-02-12T21:05:47Z",
  "aliases": [],
  "summary": "Crayfish Allows Remote Code Execution via hypercube X-Islandora-Args Header",
  "details": "### Impact\n_What kind of vulnerability is it? Who is impacted?_\n\nRemote code execution is possible in web-accessible installations of hypercube. \n\n### Patches\n_Has the problem been patched? What versions should users upgrade to?_\n\nNot yet, though no patch is neccessary if your installation of the microservices is behind a firewall.  See below.\n\n### Workarounds\n_Is there a way for users to fix or remediate the vulnerability without upgrading?_\n\nThe exploit requires making a request against Hypercube's endpoints; therefore, the ability to make use of the exploit is much reduced if the microservice is not directly accessible from the Internet, so: Prevent general access from the Internet from hitting Hypercube.  Furthermore, if you've used any of the official installation methods, your Crayfish will be behind a firewall and there is no work neccessary.\n\nThe webserver might be made to validate the structure of headers passed, but that would only be neccessary if you publicly exposed the endpoint. Standard security practices should be applied.\n\n### References\n_Are there any links users can visit to find out more?_\n\n- XBOW-024-074",
  "severity": [
    {
      "type": "CVSS_V4",
      "score": "CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H"
    }
  ],
  "affected": [
    {
      "package": {
        "ecosystem": "Packagist",
        "name": "islandora/crayfish"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "last_affected": "4.0.0"
            }
          ]
        }
      ]
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/Islandora/Crayfish/security/advisories/GHSA-c2p2-hgjg-9r3f"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/Islandora/Crayfish"
    }
  ],
  "database_specific": {
    "cwe_ids": [
      "CWE-150",
      "CWE-74"
    ],
    "severity": "CRITICAL",
    "github_reviewed": true,
    "github_reviewed_at": "2025-02-12T21:05:47Z",
    "nvd_published_at": null
  }
}