{
    "date": "July 9th, 2014",
    "title": "(0Day) Embarcadero ER/Studio Data Architect TSVisualization ActiveX loadExtensionFactory Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-224",
    "ID_2": "ZDI-CAN-2302",
    "cveId": "CVE-2014-4647",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "Embarcadero",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Embarcadero ER/Studio Data Architect. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the handling of the loadExtensionFactory method.  The issue lies in the failure to validate the size of the input buffer before copying it into a fixed-size buffer on the stack.  An attacker can leverage this vulnerability to execute code under the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\nVendor Contact Timeline:05/12/2014 - Submitted Contact Us form/request for contact at vendor site05/12/2014 - Automated reply from vendor05/14/2014 - Reply from vendor05/15/2014 - ZDI requested a PGP key for disclosure (no reply)05/19/2014 - ZDI requested a PGP key for disclosure (no reply)06/09/2014 - ZDI requested a PGP key for disclosure (no reply)\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibilty Flags DWORD within the following location in the registry:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\B4D34128-82FF-4B87-94A0-F5D4CC1FE3D0If the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797\n\n      ",
    "timeline": "2014-05-12 - Vulnerability reported to vendor\n2014-07-09 - Coordinated public release of advisory",
    "credit": "Andrea Micalizzi (rgod)"
}