{
    "date": "November 3rd, 2014",
    "title": "(0Day) Visual Mining NetCharts Server File Upload Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-372",
    "ID_2": "ZDI-CAN-2183",
    "cveId": "CVE-2014-8516",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Visual Mining",
    "products": "NetCharts Server",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Visual Mining NetCharts Server. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the handling of file uploads.  The issue lies in the failure to sanitize the path of files uploaded, allowing for them to be placed within directories accessible through the service.  An attacker can leverage this vulnerability to execute code as SYSTEM.\n  ",
    "addtionnal_details": "      This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n04/07/2014 - ZDI wrote to Visual Mining support for correct contact and PGP key04/14/2014 - ZDI wrote to Visual Mining support for correct contact and PGP key04/16/2014 - ZDI wrote to Visual Mining support for correct contact and PGP key04/24/2014 - ZDI disclosed vulnerability details to the vendor04/24/2014 - Vendor replied with questions about the ZDI report04/24/2014 - ZDI replied to vendor questions08/25/2014 - ZDI request an update09/15/2015 - ZDI requested an update and notified of intent to 0-day\n\n-- Mitigation:\n\nGiven the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n      ",
    "timeline": "2014-04-07 - Vulnerability reported to vendor\n2014-11-03 - Coordinated public release of advisory",
    "credit": "sghctoma /praudit/"
}