{
    "date": "May 5th, 2014",
    "title": "(0Day) Borland Silk Central TeeChart ActiveX Control GridLink Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-124",
    "ID_2": "ZDI-CAN-2000",
    "cveId": "",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "Borland",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Borland Silk Central. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the Borland Silk Central TeeChart ActiveX control. The control suffers from an untrusted pointer dereference vulnerability because it blindly calls an attacker-supplied memory address. An attacker can exploit this condition to achieve code execution under the context of the browser process. \n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\nVendor Contact Timeline:2013-09-01:- Case received2013-06-27 - 2014-02-19:- Multiple attempts to contact Borland (based on the timeline from ZDI-14-123)2014-05-05:- Public release of advisory\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibilty Flags DWORD within the following location in the registry:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\A92B03A8-D509-4D2F-A953-B26ED8498AB0If the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797      ",
    "timeline": "2013-09-01 - Vulnerability reported to vendor\n2014-05-05 - Coordinated public release of advisory",
    "credit": "Andrea Micalizzi aka rgod"
}