{
    "date": "May 19th, 2014",
    "title": "(0Day) SolarWinds Network Configuration Manager PEstrarg1 Heap Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-133",
    "ID_2": "ZDI-CAN-1906",
    "cveId": "CVE-2014-3459",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of SolarWinds Network Configuration Manager. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the handling of the PEstrarg1 property. The issue lies in a failure to validate the size of the input buffer before copying it into a fixed-size buffer on the heap. An attacker can leverage this vulnerability to execute code under the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 180-day deadline.\n\nVendor Contact Timeline:08/28/2013 - Case disclosed to vendor02/24/2014 - Original 180-day deadline passed02/25/2014 - ZDI sent request for status02/25/2014 - Vendor reported \"pending release vehicle\"04/08/2014 - ZDI sent a request for update04/08/2014 - Vendor reported \"fixed in NCM 7.3 - due to ship in May\"04/08/2014 - ZDI granted extension to May04/23/2014 - ZDI sent a request for update04/23/2014 - Vendor reported \"RC for 7.3 was just released yesterday. GA should be shortly.\" 05/08/2014 - ZDI requested \"any update on this GA?\"05/08/2014 - Vendor replied that they cannot commit publically to a date05/19/2014 - ZDI publicly disclosed\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibilty Flags DWORD within the following location in the registry:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\4097BE25-98A9-4779-AFF4-2F268B299D38If the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797\n\n      ",
    "timeline": "2013-08-28 - Vulnerability reported to vendor\n2014-05-19 - Coordinated public release of advisory",
    "credit": "Andrea Micalizzi aka rgod"
}