{
    "date": "October 2nd, 2014",
    "title": "(0Day) Microsoft Internet Explorer ScriptEngine Use-After-Free Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-349",
    "ID_2": "ZDI-CAN-2387",
    "cveId": "",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "Microsoft",
    "products": "Internet Explorer",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Microsoft Internet Explorer. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the handling of ScriptEngine objects. By manipulating a document's elements an attacker can force a dangling pointer to be reused after it has been freed. An attacker can leverage this vulnerability to execute code under the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch because vendor indicates that the vulnerability does not meet the bar for security servicing.\n\n06/30/2014 - ZDI disclosed report to vendor06/30/2014 - Vendor provided acknowledgment and tracking number07/09/2014 - Vendor re-provided tracking number, also case manager08/15/2014 - Vendor provided update indicating this case 'does not meet the bar for security servicing'08/25/2014 - ZDI requested the case not be closed08/28/2014 - ZDI indicated intent to disclose and requested vendor mitigation08/28/2014 - Vendor provided mitigation\n\n-- Vendor Mitigation:\n\nFor users who have not modified the default configuration for the \"Disable script debugging (Internet Explorer)\" option, no action is required.\n\nFor users who have modified the default configuration, or want to verify the configuration, follow the steps below:\n\n1.) In Internet Explorer, choose Internet Options from the Tools menu.2.) In the Internet Options dialog box, click the Advanced tab.3.) On the Advanced tab, under Browsing, make sure \"Disable Script Debugging (Internet Explorer)\" is checked.4.) Click OK.\n\n      ",
    "timeline": "2014-06-30 - Vulnerability reported to vendor\n2014-10-02 - Coordinated public release of advisory",
    "credit": "Aniway.Anyway@gmail.com"
}