{
    "date": "December 4th, 2014",
    "title": "(0Day) 3S Pocketnet Tech VMS PocketNetNVRMediaClientAxCtrl.NVRMediaViewer.1 StartRecord/StartRecordEx/StartScheuledRecord Heap Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-393",
    "ID_2": "ZDI-CAN-2405",
    "cveId": "CVE-2014-9263",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "3S Pocketnet Tech",
    "products": "VMS",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of 3S Pocketnet Tech VMS. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the PocketNetNVRMediaClientAxCtrl.NVRMediaViewer.1 control. The StartRecord, StartRecordEx, and StartScheduledRecord methods copy an attacker provided string into a fixed size heap buffer. An attacker could leverage this to execute arbitrary code in the context of the browser.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\nVendor Contact Timeline:08/13/2014 - ZDI emailed the vendor requesting a contact and PGP key09/04/2014 - ZDI emailed the vendor requesting a contact and PGP key10/13/2014 - ZDI emailed the vendor requesting a contact and PGP key11/05/2014 - ZDI emailed ICS-CERT requesting a contact or guidance 11/21/2014 - ZDI emailed ICS-CERT requesting a contact or guidance\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibility Flags DWORD within the following location in the registry:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\3075736A-FC03-452E-B155-721A1C2E9BCEIf the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797\n\n      ",
    "timeline": "2014-08-13 - Vulnerability reported to vendor\n2014-12-04 - Coordinated public release of advisory",
    "credit": "Carsten Eiram, Risk Based Security"
}