{
    "date": "October 5th, 2015",
    "title": "(0Day) Agilent Technologies 2100 Expert CSDispatcher.exe Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-429",
    "ID_2": "ZDI-CAN-2279",
    "cveId": "CVE-2014-5145",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Agilent Technologies",
    "products": "2100 Expert",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Agilent Technologies 2100 Expert. Authentication is not required to exploit this vulnerability. \nThe specific flaw exists within the CSDispatcher.exe process, which listens on port 3434. By sending a crafted packet to this port, an attacker is able to control a dereferenced pointer, and execute arbitrary code in the SYSTEM context.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n08/01/2014 - ZDI disclosed to vendor08/12/2014 - Vendor indicated 3rd party company involvement and asked for additional assistance on repro steps and feedback on fixing02/27/2015 - ZDI dropped 0-day on a different case for this vendor and shortly after senior persons from the vendor's development indicated further willingness to work with ZDI03/24/2015 - Vendor indicated they are working on the issue and mustering resources03/26/2015 - ZDI inquired how close they may be to resolution and for any ETA03/31/2015 - The vendor indicated the case was escalated internally07/07/2015 - ZDI again requested any update07/10/2015 - The vendor indicated they had gone through a restructuring07/23/2015 - The vendor requested a call with ZDI09/21/2015 - The ZDI call with the vendor occurred and the vendor indicated a favorable update was immediately forthcoming09/28/2015 - A second ZDI call with the vendor occurred in which the vendor indicated they finally have a fix, but cannot release until Nov09/28/2015 - ZDI indicated final intent to 0-day\n\n-- Mitigation:\n\nGiven the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n      ",
    "timeline": "2014-08-01 - Vulnerability reported to vendor\n2015-10-05 - Coordinated public release of advisory",
    "credit": "Andrea Micalizzi (rgod)"
}