{
    "date": "May 30th, 2014",
    "title": "(0Day) VMware vCenter Server Appliance Ruby vSphere Console Privilege Escalation Vulnerability",
    "ID_1": "ZDI-14-159",
    "ID_2": "ZDI-CAN-2003",
    "cveId": "CVE-2014-3790",
    "baseScore": "6.0",
    "vectorString": "AV:L/AC:H/Au:S/C:C/I:C/A:C",
    "vendors": "VMWare, Inc.",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of VMware vCenter Appliance. Authentication is required to exploit this vulnerability. \nThe specific flaw exists within the usage of the Ruby vSphere Console (RVC) provided by the vCenter Server Appliance. Commands can be run in a privileged context allowing an attacker to break-out of a chroot jail.  This allows for an attacker to elevate privilege and execute commands as root.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 180-day deadline.\n\nVendor Contact Timeline:11/07/2013 - Case disclosed to vendor11/07/2013 - Vendor acknowledged12/02/2013 - Vendor confirmed reproduction02/26/2014 - Vendor provided ETA August or September05/02/2014 - Vendor provided ETA of August and December05/02/2014 - ZDI asked vendor for something sooner05/02/2014 - Vendor confirmed dates and will let ZDI know of any changes05/06/2014 - Original 180-deadline passed05/30/2014 - Public release of advisory\n\n-- Vendor Provided Mitigations:\n\nRemove all users from the shellaccess group with the following command: usermod -R shellaccess LOGIN\n\nOR\n\nRemove the line \"AllowGroups shellaccess wheel\" from the /etc/ssh/sshd_config Restart the sshd service with the following command: service sshd restart\n\nThis issue only affects vCenter Server Appliance 5.1 and vCenter Server Appliance 5.5. No other products are affected by this issue.\n\n      ",
    "timeline": "2013-11-07 - Vulnerability reported to vendor\n2014-05-30 - Coordinated public release of advisory",
    "credit": "Shanon Olsson"
}