{
    "date": "June 2nd, 2014",
    "title": "(0Day) Rocket Servergraph Admin Center for TSM fileRequestServlet writeDataFile Command Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-161",
    "ID_2": "ZDI-CAN-2263",
    "cveId": "CVE-2014-3914",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Rocket Software",
    "products": "Rocket Servergraph",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Rocket Servergraph Admin Center for Tivoli Storage Manager. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the fileRequestServlet servlet. This servlet is vulnerable to a directory traversal vulnerability when processing writeDataFile commands. A remote attacker can leverage this vulnerability to execute remote code under the context of the SYSTEM user.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\nVendor Contact Timeline:04/16/2014 - ZDI emailed the vendor's support requesting contact04/16/2014 - Automated reply from vendor05/12/2014 - ZDI emailed the vendor's support requesting contact05/12/2014 - Automated reply from vendor05/05/2014 - ZDI telephoned vendor's support line and were told we would receive a callback (no callback)05/19/2014 - ZDI emailed the vendor's support requesting contact05/19/2014 - Automated reply from vendor05/21/2014 - ZDI emailed the vendor's support requesting contact and indicated final attempt/intent to move toward 0-day06/02/2014 - Public release of advisory\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n      ",
    "timeline": "2014-04-16 - Vulnerability reported to vendor\n2014-06-02 - Coordinated public release of advisory",
    "credit": "Andrea Micalizzi (rgod)"
}