{
    "date": "June 2nd, 2014",
    "title": "(0Day) Ericom AccessNow Server Stack Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-14-160",
    "ID_2": "ZDI-CAN-2268",
    "cveId": "CVE-2014-3913",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Ericom",
    "products": "AccessNow Server",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Ericom AccessNow Server.  Authentication is not required to exploit this vulnerability.\nThe specific flaw exists in the way AccessServer32.exe handles requests for non-existent files.  AccessServer32.exe performs insufficient bounds checking on user-supplied data which results in stack corruption.  An attacker can exploit this condition to achieve remote code execution as SYSTEM.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI vulnerability disclosure policy on lack of vendor response.\n\nVendor Contact Timeline:05/02/2014 - ZDI emailed the vendor requesting contact05/05/2014 - ZDI emailed the vendor requesting contact05/05/2014 - ZDI called vendor's support and held for 15 minutes with no answer05/05/2014 - Automated reply from vendor05/19/2014 - ZDI emailed the vendor requesting contact05/19/2014 - Automated reply from vendor05/21/2014 - ZDI emailed the vendor's support requesting contact and indicated final attempt/intent to move toward 0-day05/21/2014 - Automated reply from vendor06/02/2014 - Public release of advisory \n\nMitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\nVendor Patch:Vendor has issued an update to correct this vulnerability. More details can be found at: \n\nhttp://www.ericom.com/security-ERM-2014-610.asp\n\n      ",
    "timeline": "2014-05-02 - Vulnerability reported to vendor\n2014-06-02 - Coordinated public release of advisory",
    "credit": "Anonymous"
}