{
    "date": "February 5th, 2019",
    "title": "(0Day) Hewlett Packard Enterprise Intelligent Management Center eventInfo_content Expression Language Injection Remote Code Execution Vulnerability",
    "ID_1": "ZDI-19-170",
    "ID_2": "ZDI-CAN-6762",
    "cveId": "CVE-2019-5345",
    "baseScore": "8.8",
    "vectorString": "AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Hewlett Packard Enterprise",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Hewlett Packard Enterprise Intelligent Management Center. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\nThe specific flaw exists within the handling of the beanName parameter provided to the eventInfo_content.xhtml endpoint. When parsing the beanName parameter, the process does not properly validate a user-supplied string before using it to render a page. An attacker can leverage this vulnerability to execute code in the context of SYSTEM.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n08/17/18 - ZDI sent the vulnerability report to the vendor01/25/19 - ZDI notified the vendor if this is not patched that the report will be published as an 0-day on 2/501/30/19 - The vendor replied \"We are currently checking with engineering to try to get an updated schedule for fixes for all of the outstanding ZDIs we have open. We'll let you know the status as soon as we hear back.\"\n\n-- Mitigation:\n\nGiven the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2018-08-29 - Vulnerability reported to vendor\n2019-02-05 - Coordinated public release of advisory\n2021-03-02 - Advisory Updated",
    "credit": "Matthias Kaiser and Steven Seeley of Incite Team (Source Incite)"
}