{
    "date": "April 30th, 2019",
    "title": "(0Day) Microsoft Visual Studio asm Memory Corruption Remote Code Execution Vulnerability",
    "ID_1": "ZDI-19-448",
    "ID_2": "ZDI-CAN-7816",
    "cveId": "",
    "baseScore": "8.1",
    "vectorString": "AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Microsoft",
    "products": "",
    "description": "This vulnerability allows attackers to execute arbitrary code on executables compiled using vulnerable installations of Microsoft Visual Studio. Attack vectors will vary depending on the nature of the executable in question, but would include opening a specially crafted file which was compiled with an affected version of Visual Studio.\nThe specific flaw exists within the compilation of __asm blocks in Visual C++. Incorrect output produced by the compiler can result in a memory corruption condition. An attacker can leverage this vulnerability to execute code in the context of the current process.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n01/15/19 – ZDI sent the vulnerability report to the vendor01/15/19 – The vendor replied with tracking number01/24/19 – The vendor replied that they will not be pursuing a fix for this case due to stability issues in the 2015 version and the low severity rating based on attack vector01/25/19 – ZDI asked the vendor to re-consider 01/25/19 – The vendor acknowledged the request02/05/19 – ZDI requested any available update02/08/19 - The vendor acknowledged the request02/14/19 – ZDI requested any available update02/21/19 – ZDI requested any available update02/21/19 - The vendor acknowledged the request04/02/19 – ZDI requested any available update04/03/19 – The final reply back from the vendor was that they would not “port the change as hotfix from 15.9 to prior VS releases”\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application to trusted files.",
    "timeline": "2019-01-15 - Vulnerability reported to vendor\n2019-04-30 - Coordinated public release of advisory\n2019-11-01 - Advisory Updated",
    "credit": "Simon Zuckerbraun"
}