{
    "date": "July 22nd, 2019",
    "title": "(0Day) Microsoft Windows ole32 OleCreateFontIndirectExt Out-Of-Bounds Read Information Disclosure Vulnerability",
    "ID_1": "ZDI-19-670",
    "ID_2": "ZDI-CAN-7959",
    "cveId": "",
    "baseScore": "3.3",
    "vectorString": "AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
    "vendors": "Microsoft",
    "products": "",
    "description": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Microsoft Windows. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the parsing of Icon files in the ole32 library. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute code in the context of the current process.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n02/11/19 – ZDI reported the vulnerability to the vendor02/10/19 – The vendor acknowledged02/18/19 – The vendor requested further details02/20/19 – ZDI provided the requested information02/22/19 – The vendor requested more details02/22/19 – ZDI provided the requested information02/25/19 – The vendor requested further details02/26/19 – ZDI provided the requested information06/07/19 – The vendor requested more details06/11/19 – ZDI provided the requested information04/22/19 – The vendor indicated the case did not meet their bar for servicing04/30/19 – ZDI confirmed the intention to 0-day the case and that the vendor would be notified at that time07/09/19 – ZDI notified the vendor of the intention to publish the 0-day on 7/22/19\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application to trusted files.",
    "timeline": "2019-02-12 - Vulnerability reported to vendor\n2019-07-22 - Coordinated public release of advisory",
    "credit": "Anonymous"
}