{
    "date": "January 10th, 2019",
    "title": "(0Day) Microsoft Windows vcf File Insufficient UI Warning Remote Code Execution Vulnerability",
    "ID_1": "ZDI-19-013",
    "ID_2": "ZDI-CAN-6920",
    "cveId": "",
    "baseScore": "7.8",
    "vectorString": "AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
    "vendors": "Microsoft",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Microsoft Windows. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the processing of VCard files. Crafted data in a VCard file can cause Windows to display a dangerous hyperlink. The user interface fails to provide any indication of the hazard. An attacker can leverage this vulnerability to execute code in the context of the current user.",
    "addtionnal_details": "08/06/18 - ZDI reported the vulnerability to the vendor08/07/18 - The vendor acknowledged the report and provided a tracking #10/01/18 – The vendor requested an additional file10/03/18 – ZDI provided added files and a new PoC10/03/18 – The vendor advised the report did not meet the bar for service10/05/18 – ZDI advised that we believe the report is exploitable and notified the vendor of the intent to 0-day on 10/16/1810/08/18 – The vendor advised ZDI they had re-considered a fix and requested an extension to 01/08/1910/09/18 – ZDI agreed to the short extension11/14/18 – The vendor again advised ZDI of the target patch date 01/08/1912/12/18 – The vendor provided ZDI a CVE12/19/18 - The vendor wrote to ZDI to advise that “engineering team had decided to pursue the fix as v.Next” and “Microsoft has decided that it will not be fixing this vulnerability and we are closing this case”12/27/18 – ZDI notified the vendor of the intent to 0-day on 01/07/18",
    "timeline": "2018-09-06 - Vulnerability reported to vendor\n2019-01-10 - Coordinated public release of advisory\n2019-05-30 - Advisory Updated",
    "credit": "John Page (aka hyp3rlinx)"
}