{
    "date": "January 29th, 2019",
    "title": "(0Day) Wecon LeviStudioU DataLogTool INI Parser Stack-based Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-19-144",
    "ID_2": "ZDI-CAN-6346",
    "cveId": "CVE-2019-6537",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "Wecon",
    "products": "LeviStudioU",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Wecon LeviStudioU. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within DataLogTool.exe. When parsing a string within an INI file, the process does not properly validate the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n06/08/18 - ZDI provided 3 reports to the ICS-CERT06/13/18 - ICS-CERT provided an ICS-VU#09/25/18 - ZDI requested a status09/26/18 - ICS-CERT advised that they requested status from the vendor on 09/18/18 and were awaiting a reply11/15/18 - ICS-CERT advised only that the vendor was \"currently working the issues reported\"11/26/18 - ZDI requested an ETA from ICS-CERT who indicated they requested this12/06/18 - ICS-CERT advised ZDI that the vendor was \"in the process of testing their update\" and indicated \"possibility of release in 2 weeks\"01/09/19 - ZDI advised ICS-CERT of the intention to 0-day publish01/25/19 - ZDI telephoned ICS-CERT to discuss status and 0-day publish\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application to trusted files.      ",
    "timeline": "2018-06-08 - Vulnerability reported to vendor\n2019-01-29 - Coordinated public release of advisory\n2019-02-12 - Advisory Updated",
    "credit": "Mat Powell of Trend Micro Zero Day Initiative"
}