{
    "date": "December 12th, 2019",
    "title": "(0Day) NETGEAR AC1200 mini_httpd Password Storage Information Disclosure Vulnerability",
    "ID_1": "ZDI-19-1011",
    "ID_2": "ZDI-CAN-8615",
    "cveId": "",
    "baseScore": "4.4",
    "vectorString": "AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
    "vendors": "NETGEAR",
    "products": "",
    "description": "This vulnerability allows network-adjacent attackers to disclose sensitive information on vulnerable installations of NETGEAR AC1200 Smart WiFi Router. Authentication is required to exploit this vulnerability.\nThe specific flaw exists within the storage of administrator credentials. The credentials are stored in a recoverable format making them subject to password reuse attacks. An attacker can leverage this vulnerability to disclose sensitive information in the context of the administrator.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n06/27/19 – ZDI reported the vulnerability to the vendor06/27/19 – The vendor acknowledged the report07/04/19 – The vendor confirmed the report as valid08/28/19 – ZDI requested an update08/29/19 – The vendor indicated they were working on a fix10/08/19 – ZDI requested an update10/10/19 – ZDI asked if a fix for a similar case included the fix for this one10/11/19 – The vendor indicated the fix was not included10/17/19 – ZDI requested an ETA for resolution 11/11/19 – ZDI requested an update11/29/19 – ZDI requested an update 12/05/19 – ZDI advised the vendor of the intention to publish the report as a 0-day on 12/12/2019\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2019-04-26 - Vulnerability reported to vendor\n2019-12-12 - Coordinated public release of advisory",
    "credit": "Michael Flanders of Trend Micro Zero Day Initiative"
}