{
    "date": "December 12th, 2019",
    "title": "(0Day) Linux Kernel proc stat Improper Access Control Information Disclosure Vulnerability",
    "ID_1": "ZDI-19-1012",
    "ID_2": "ZDI-CAN-7607",
    "cveId": "",
    "baseScore": "5.5",
    "vectorString": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
    "vendors": "",
    "products": "",
    "description": "This vulnerability allows local attackers to disclose sensitive information on affected installations of the Linux kernel. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the logic that controls access to the /proc/<pid>/stat file. Access is not properly restricted from unauthorized processes, which can result in disclosure of useful memory addresses. An attacker can leverage this in conjunction with other vulnerabilities to escalate privileges.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n06/04/19 – ZDI provided the vulnerability report to the vendor06/04/19 – The vendor acknowledged receipt of the report09/13/19 – ZDI requested an update09/23/19 – The vendor replied that they were investigating the status09/25/19 – The vendor engineer confirmed the investigation was active10/08/19 - ZDI requested an update10/22/19 - ZDI requested an update11/21/19 – The vendor engineered verified the issue, exists but did not indicate commitment to fix11/21/19 – ZDI requested an ETA11/22/19 – The vendor replied they feel it is “more of a kernel hardening issue” and confirmed commitment to patch the following week11/24/19 – ZDI agreed to wait11/27/19 – The vendor replied that they have located an optional configuration remediation already implemented and will not do further patching/remediation at this time12/10/19 – ZDI advised the vendor of the intention to publish the report as 0-day on 12/12/19\n\n-- Mitigation:Use the hidepid mount(8) parameter to mitigate this issue.",
    "timeline": "2019-06-04 - Vulnerability reported to vendor\n2019-12-12 - Coordinated public release of advisory",
    "credit": "Federico Bento"
}