{
    "date": "August 5th, 2019",
    "title": "(0Day) SolarWinds Orion Network Performance Monitor ExecuteExternalProgram Privilege Escalation Vulnerability",
    "ID_1": "ZDI-19-687",
    "ID_2": "ZDI-CAN-8476",
    "cveId": "",
    "baseScore": "7.8",
    "vectorString": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "",
    "products": "",
    "description": "This vulnerability allows local attackers to escalate privileges on affected installations of SolarWinds Orion Network Performance Monitor. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the ExecuteExternalProgram method. The issue results from the lack of proper validation of user-supplied data, which can result in deserialization of untrusted data. An attacker can leverage this vulnerability to escalate privileges and execute code in the context of SYSTEM.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n03/29/19 - ZDI reported the vulnerability to the vendor03/29/19 – The vendor acknowledged04/30/19 – The vendor provided an update indicating they were working on a fix06/03/19 – The vendor provided an update indicating they were working on a fix07/09/19 – The vendor provided an update indicating they were working on a fix07/09/19 – ZDI requested an ETA for the fix and reminded the vendor of the due date, 07/27/1907/10/19 – The vendor indicated the ETA was Q4 and requested an extension07/10/19 – ZDI suggested the vendor push the release forward to early August and expressed the intention to 0-day publish the report otherwise07/10/19 – The vendor indicated their next release cycle would be in Q407/11/19 – ZDI requested a closer estimate of ‘Q4’07/12/19 – The vendor indicated they anticipated October07/21/19 – ZDI notified the vendor the intention to 0-day the case on 05/08\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2019-03-29 - Vulnerability reported to vendor\n2019-08-05 - Coordinated public release of advisory",
    "credit": "Ron Waisberg of Trend Micro Research"
}