{
    "date": "March 7th, 2019",
    "title": "(0Day) Advantech WebAccess Node Product Installation File Access Control Modification Privilege Escalation Vulnerability",
    "ID_1": "ZDI-19-257",
    "ID_2": "ZDI-CAN-7411",
    "cveId": "",
    "baseScore": "7.8",
    "vectorString": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Advantech",
    "products": "",
    "description": "This vulnerability allows local attackers to escalate privileges on vulnerable installations of Advantech WebAccess Node. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the access control that is set and modified during the installation of the product. The product installation weakens existing access control restrictions of current system files, then sets weak access control restrictions on new files. An attacker can leverage this vulnerability to escalate privileges to the level of an administrator. ",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n11/01/18 – ZDI sent the vulnerability report to ICS-CERT11/05/18 – The vendor replied with tracking number12/19/18 – ICS-CERT advised ZDI the vendor was working on a fix01/22/19 – ZDI wrote ICS-CERT and indicated we saw a new build publish for this product on 1/10/19 and asked if this fix was included01/23/19 – ICS-CERT indicated they requested an updated status from the vendor02/15/19 – ZDI requested a status update from ICS-CERT02/18/19 – ICS-CERT advised ZDI only that Advantech is working on a fix02/18/19 – ZDI requested any ETA02/18/19 – ICS-CERT agreed to request an ETA from the vendor02/20/19 – ZDI notified the vendor if these are not patched that the reports will be published as 0-day on 03/07/19\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2018-11-01 - Vulnerability reported to vendor\n2019-03-07 - Coordinated public release of advisory\n2019-05-30 - Advisory Updated",
    "credit": "Fritz Sands of Trend Micro Zero Day Initiative"
}