{
    "date": "March 4th, 2019",
    "title": "(0Day) Hewlett Packard Enterprise Intelligent Management Center GWT deviceservice saveSelectedDevices Expression Language Injection Remote Code Execution Vulnerability",
    "ID_1": "ZDI-19-242",
    "ID_2": "ZDI-CAN-7008",
    "cveId": "CVE-2019-5363",
    "baseScore": "8.8",
    "vectorString": "AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Hewlett Packard Enterprise",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Hewlett Packard Enterprise Intelligent Management Center. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\nThe specific flaw exists within the saveSelectedDevices method of the deviceservice servlet. When parsing the beanName parameter, the process does not properly validate a user-supplied string before using it to render a page. An attacker can leverage this vulnerability to execute code in the context of SYSTEM.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n10/23/18 – ZDI sent the vulnerability reports to the vendor11/28/18 – The vendor replied with tracking number01/09/19 – ZDI requested an update (for these and other related reports)01/30/19 – The vendor PSIRT replied they were working with the engineering team to get an updated schedule02/14/19 – ZDI notified the vendor if these are not patched that the reports will be published as 0-day on 03/04\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2018-10-23 - Vulnerability reported to vendor\n2019-03-04 - Coordinated public release of advisory\n2021-03-02 - Advisory Updated",
    "credit": "Matthias Kaiser and Steven Seeley of Incite Team (Source Incite)"
}