{
    "date": "September 4th, 2019",
    "title": "(0Day) Google Android v4l2 Double Free Privilege Escalation Vulnerability",
    "ID_1": "ZDI-19-780",
    "ID_2": "ZDI-CAN-8316",
    "cveId": "CVE-2019-10565",
    "baseScore": "7.8",
    "vectorString": "AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H",
    "vendors": "Google",
    "products": "",
    "description": "This vulnerability allows local attackers to escalate privileges on affected installations of Google Android. An attacker must first obtain the ability to execute high-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the v4l2 driver. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this to escalate privileges in the context of the kernel.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n03/13/19 - ZDI reported a vulnerability to the vendor03/13/19 - The vendor acknowledged and requested further information03/25/19 - ZDI provided the requested details06/28/19 - The vendor confirmed the vulnerability would be fixed, but did not provide an estimated time frame07/12/19 - ZDI requested an estimated date for the fix07/12/19 - The vendor indicated they could not specify a date08/21/19 - ZDI requested an update08/26/19 - The vendor indicated there were no further updates08/28/19 - ZDI notified the vendor of the intention to disclose the report as a 0-day advisory\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it.",
    "timeline": "2019-03-12 - Vulnerability reported to vendor\n2019-09-04 - Coordinated public release of advisory\n2020-03-13 - Advisory Updated",
    "credit": "Lance Jiang and Moony Li of TrendMicro Research"
}