{
    "date": "June 21st, 2023",
    "title": "(0Day) ManageEngine ADSelfService Plus GINA Client Insufficient Verification of Data Authenticity Authentication Bypass Vulnerability",
    "ID_1": "ZDI-23-891",
    "ID_2": "ZDI-CAN-17009",
    "cveId": "CVE-2023-35719",
    "baseScore": "6.8",
    "vectorString": "AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "ManageEngine",
    "products": "ADSelfService Plus",
    "description": "This vulnerability allows physically present attackers to execute arbitrary code on affected installations of ManageEngine ADSelfService Plus. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the Password Reset Portal used by the GINA client. The issue results from the lack of proper authentication of data received via HTTP. An attacker can leverage this vulnerability to bypass authentication and execute code in the context of SYSTEM.",
    "addtionnal_details": "04/29/22 – The ZDI reported the vulnerability to the vendor. \n\n05/01/22 – The vendor acknowledged the report.  \n\n07/13/22 – The vendor asked for additional details.  \t         \n\n07/13/22 – The ZDI provided additional details.  \n\n08/09/22 – The vendor states they are investigating the report.  \n\n08/09/22 – The vendor asked for additional details.  \n\n08/09/22 – The ZDI provided additional details. \n\n09/13/22 – The vendor states this vulnerability can be mitigated using the best practices.  \n\n04/19/23 – The ZDI asked for an update.  \n\n04/19/23 – The vendor states that following the best practice guidelines will mitigate this vulnerability and that they would consider                     adding user alerts in a future release.  \n\n06/08/23 – The ZDI conducted a review, and we determined that the product is still vulnerable even with best practices implemented.  \n\n06/13/23 – The ZDI informed the vendor of our findings and that the case will be published as a zero-day advisory on 06/21/23. \n\n-- Mitigation: Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2022-04-29 - Vulnerability reported to vendor\n2023-06-21 - Coordinated public release of advisory",
    "credit": "Pedro Ribeiro (pedrib@gmail.com | @pedrib1337), João Bigotte and Ashley King from Agile Information Security"
}