{
    "date": "January 23rd, 2018",
    "title": "(0Day) ZyXEL P-870H-51 DSL Router Multiple Remote Code Execution Vulnerabilities",
    "ID_1": "ZDI-18-135",
    "ID_2": "ZDI-CAN-4540",
    "cveId": "CVE-2018-1164",
    "baseScore": "9.0",
    "vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C",
    "vendors": "ZyXEL",
    "products": "",
    "description": "    This vulnerability allows remote attackers to cause a denial-of-service condition on vulnerable installations of ZyXEL P-870H-51 DSL Router. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within numerous exposed CGI endpoints. The vulnerability is caused by improper access controls that allow access to critical functions without authentication. An attacker can use this vulnerability to reboot affected devices, along with other actions.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n06/21/17 - ZDI reported vulnerability to vendor09/14/17 - ZDI contacted vendor requesting a status update09/19/17 - Vendor acknowledged10/12/17 - Vendor stated product was legacy and was assigned end of support on 2016. Vendor stated their plan to patch by April 2018 but added that 'the schedule might be subject to change due to resource leveling'10/17/17 - ZDI requested public documentation confirming end of support10/26/17 - Vendor stated this was a project model and there was no public end of life announcement01/18/18 - ZDI notified the vendor the intention to 0-day the case\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.      ",
    "timeline": "2017-06-21 - Vulnerability reported to vendor\n2018-01-23 - Coordinated public release of advisory",
    "credit": "Hubert WS Lin of Trend Micro"
}