{
    "date": "January 16th, 2018",
    "title": "(0Day) Quest NetVault Backup Process Manager Service Multipart Boundary Header Stack-based Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-18-004",
    "ID_2": "ZDI-CAN-4215",
    "cveId": "CVE-2018-1161",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Quest",
    "products": "NetVault Backup",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Quest NetVault Backup. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within nvwsworker.exe. When parsing the boundary header of a multipart request, the process does not properly validate the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute code under the context of SYSTEM.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n05/26/17 - ZDI wrote to Dell requesting a disclosure contact for the product05/29/17 - Dell responded and provided a vendor contact at Quest05/29/17 - ZDI reached out to the provided contact05/30/17 - The contact provided a PGP key to accept disclosure06/20/17 - The contact provided a group mailing list for further disclosures05/30/17 - 6/22/17 - ZDI reported 25 vulnerabilities to the contact and/or the group list07/03/17 - The vendor asked clarifying questions07/03/17 - ZDI responded07/10/17 - ZDI responded with further information11/02/17 - ZDI wrote the contact and the group list requesting a status update11/17/17 - The ZDI PM called and left a message for the contact and emailed the contact and the group list requesting a status update12/06/17 - The ZDI PM met with the vendor team by phone at their request and explained the intent to 0-day the reports\n\nThis is now fixed with NetVault v11.4.5.15.\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.      ",
    "timeline": "2017-12-06 - Vulnerability reported to vendor\n2018-01-16 - Coordinated public release of advisory",
    "credit": "rgod"
}