{
    "date": "July 13th, 2018",
    "title": "(0Day) Advantech WebAccess HMI Designer PM3 File Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-18-631",
    "ID_2": "ZDI-CAN-5587",
    "cveId": "",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "Advantech",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Advantech WebAccess HMI Designer. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the parsing of project files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to execute code under the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n01/19/18 - ZDI disclosed to ICS-CERT06/05/18 - ZDI wrote to ICS-CERT requesting an update06/05/18 - ICS-CERT replied that the vendor has not replied to requests for a date of the fix06/18/18 - ICS-CERT notified ZDI of a similar (but seemingly not matched) advisory06/18/18 - ZDI pointed out that the vendor is still offering only the version ZDI reported vulnerable online, not a new version06/19/18 - ICS-CERT agreed to try to contact the vendor again07/06/18 - ZDI notified the vendor of the intent to release the report as 0-day 07/13/2018\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application to trusted files.      ",
    "timeline": "2018-01-19 - Vulnerability reported to vendor\n2018-07-13 - Coordinated public release of advisory\n2018-07-13 - Advisory Updated",
    "credit": "Ariele Caltabiano (kimiya)"
}