{
    "date": "September 14th, 2021",
    "title": "(0Day) Autodesk Navisworks PDF File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability",
    "ID_1": "ZDI-21-1064",
    "ID_2": "ZDI-CAN-13718",
    "cveId": "CVE-2021-27045",
    "baseScore": "3.3",
    "vectorString": "AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
    "vendors": "",
    "products": "",
    "description": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Autodesk Navisworks. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the parsing of PDF files. Crafted data in a PDF file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n04/23/21 - ZDI reported the vulnerabilities to the vendor04/29/21 - The vendor confirmed receipt of the reports and requested technical clarification 05/04/21 - ZDI confirmed that the requested details were provided in the reports 05/21/21 - The vendor communicated that the vulnerabilities affect a third-party component 08/16/21 - The vendor requested an extension08/16/21 - ZDI agreed to an extension until 09/01/202108/17/21 - The vendor requested an extension until 09/13/2108/17/21 - ZDI agreed to an extension until 09/13/202108/25/21 - The vendor requested an extension until 10/01/2108/26/21 - ZDI notified the vendor of the intention to publish these reports as 0-dayadvisories on 09/13/20219/13/21 - The vendor published a fix (https://www.autodesk.com/trust/security-advisories/adsk-sa-2021-0008)\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2021-04-22 - Vulnerability reported to vendor\n2021-09-14 - Coordinated public release of advisory\n2021-09-15 - Advisory Updated",
    "credit": "Michael DePlante (@izobashi) of Trend Micro's Zero Day Initiative"
}