{
    "date": "July 22nd, 2021",
    "title": "(0Day) Apple macOS AudioToolboxCore LOAS File Parsing Out-Of-Bounds Read Information Disclosure Vulnerability",
    "ID_1": "ZDI-21-890",
    "ID_2": "ZDI-CAN-12997",
    "cveId": "CVE-2021-30742",
    "baseScore": "3.3",
    "vectorString": "AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
    "vendors": "Apple",
    "products": "",
    "description": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Apple macOS. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the GetFramesPerPacket function in AudioToolboxCore. Crafted data in a LOAS file can trigger a read past the end of an allocated data structure. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n02/03/21 – ZDI reported the vulnerability to the vendor05/26/21 – ZDI requested an update06/04/21 – ZDI requested an update06/16/21 – ZDI requested an update06/18/21 – ZDI requested an update and notified the vendor of the intention to publish the report as a 0-day advisory06/18/21 – The vendor indicated the case would be published in an upcoming advisory06/22/21 – ZDI requested a more specific date for the advisory07/07/21 – ZDI requested an update07/07/21 – The vendor indicated the issue had been addressed and would be published in an upcoming update07/08/21 – ZDI requested a more specific date for the advisory07/09/21 – The vendor indicated the advisory would be available by the end of the following week07/12/21 – ZDI agreed to hold advisories for a few days07/20/21 – ZDI notified the vendor of the intention to publish the case as a 0-day advisory on 07/22/21\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2021-02-03 - Vulnerability reported to vendor\n2021-07-22 - Coordinated public release of advisory",
    "credit": "Mickey Jin of Trend Micro Mobile Security Research Team"
}