{
    "date": "August 23rd, 2022",
    "title": "(0Day) (Pwn2Own) Oracle VirtualBox SLIRP sosendoob Out-Of-Bounds Read Information Disclosure Vulnerability",
    "ID_1": "ZDI-22-1151",
    "ID_2": "ZDI-CAN-17431",
    "cveId": "CVE-2022-39423",
    "baseScore": "4.4",
    "vectorString": "AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
    "vendors": "Oracle",
    "products": "",
    "description": "This vulnerability allows local attackers to disclose sensitive information on affected installations of Oracle VirtualBox. An attacker must first obtain the ability to execute high-privileged code on the target guest system in order to exploit this vulnerability.\nThe specific flaw exists within the sosendoob method. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the hypervisor.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI Pwn2Own 90-day timeline.\n\n05/18/22 – ZDI reported the vulnerability to the vendor.  08/15/22 – The vendor inquired about the vulnerability report.   08/16/22 – ZDI re-disclosed the vulnerability to the vendor.   08/16/22 – ZDI notified the vendor of the intention to publish the case as a zero-day advisory on 08/23/22.    08/16/22 – The vendor requested an extension until 10/23/22.  08/16/22 – ZDI declined the extension request.  \n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application.The vendor fixed the issue on 18 October 2022 https://www.oracle.com/security-alerts/cpuoct2022.html",
    "timeline": "2022-05-26 - Vulnerability reported to vendor\n2022-08-23 - Coordinated public release of advisory\n2022-10-21 - Advisory Updated",
    "credit": "Billy Jheng Bing-Jhong (@st424204), Muhammad Alifa Ramdhan (@n0psledbyte), Nguyen Hoang Thạch (@hi_im_d4rkn3ss) of STAR Labs"
}