{
    "date": "June 15th, 2020",
    "title": "(0Day) (Pwn2Own) Inductive Automation Ignition ServerMessageHeader Deserialization of Untrusted Data Information Disclosure Vulnerability",
    "ID_1": "ZDI-20-714",
    "ID_2": "ZDI-CAN-10277",
    "cveId": "",
    "baseScore": "5.3",
    "vectorString": "AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
    "vendors": "",
    "products": "",
    "description": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Inductive Automation Ignition. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the handling of serialized data. The issue results in the lack of proper authentication required to query to server. An attacker can leverage this in conjunction with other vulnerabilities to execute code in the context of SYSTEM.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n01/22/20 – ZDI disclosed the vulnerability report to the vendor onsite at Pwn2Own 04/22/20 – ZDI requested an update04/23/20 – The vendor provided an update that the report was still in work05/05/20 – ICS-CERT requested an update and the vendor replied no ETA was available05/06/20 – ZDI agreed to wait until further notice05/20/20 – ZDI requested an update and the vendor replied that there was no ETA06/03/20 - ICS-CERT requested an update and the vendor replied no ETA was available06/04/20 – ZDI notified the vendor and ICS-CERT that the report would be published as a 0-day advisory on 06/15/20\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2020-01-30 - Vulnerability reported to vendor\n2020-06-15 - Coordinated public release of advisory",
    "credit": "Chris Anastasio (muffin) and Steven Seeley (mr_me) of Incite Team"
}