{
    "date": "June 15th, 2020",
    "title": "(0Day) NETGEAR R6700 httpd Firmware Upload Stack-based Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-20-712",
    "ID_2": "ZDI-CAN-9703",
    "cveId": "",
    "baseScore": "8.8",
    "vectorString": "AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "NETGEAR",
    "products": "",
    "description": "This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of NETGEAR R6700 routers.  Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the httpd service, which listens on TCP port 80 by default. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length, stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n01/08/20 - ZDI reported the vulnerability to the vendor04/30/20 - ZDI contacted the vendor requesting a status update05/01/20 - The vendor requested an extension until the end of June 05/05/20 - ZDI agreed on extension until June 15th05/28/20 - ZDI requested a status update05/29/20 - The vendor requested an extension until the end of June05/29/20 - ZDI declined the request and notified the vendor the case would be published as 0-day on 06/15/20\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2020-01-08 - Vulnerability reported to vendor\n2020-06-15 - Coordinated public release of advisory",
    "credit": "d4rkn3ss from VNPT ISC"
}