{
    "date": "February 20th, 2020",
    "title": "(0Day) Rockwell Automation FactoryTalk RNADiagnosticsSrv Deserialization Of Untrusted Data Remote Code Execution Vulnerability",
    "ID_1": "ZDI-20-261",
    "ID_2": "ZDI-CAN-9309",
    "cveId": "CVE-2020-6967",
    "baseScore": "9.8",
    "vectorString": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Rockwell Automation",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Rockwell Automation ThinManager. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the RNADiagnosticsSrv endpoint, which listens on TCP port 8082 by default. The issue results from the lack of proper validation of user-supplied data, which can result in deserialization of untrusted data. An attacker can leverage this vulnerability to execute code under the context of SYSTEM.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n10/01/19 - ZDI reported a vulnerability to ICS-CERT10/01/19 - ICS-CERT provided ZDI with an ICS-VU #01/24/20 - ZDI contacted ICS-CERT requesting a status update01/27/20 -  ICS-CERT shared the vendor's preference to release the fix along with other cases reported in January 202001/27/20 - ZDI reminded these were different cases with different due dates and offered an extension for this particular case02/11/20 - ZDI notified ICS-CERT the intention to publish the case as 0-day on 02/20/20\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2019-10-01 - Vulnerability reported to vendor\n2020-02-20 - Coordinated public release of advisory",
    "credit": "rgod of 9sg"
}