{
    "date": "February 4th, 2020",
    "title": "(0Day) Hewlett Packard Enterprise Intelligent Management Center deviceThresholdConfig Expression Language Injection Remote Code Execution Vulnerability",
    "ID_1": "ZDI-20-152",
    "ID_2": "ZDI-CAN-8969",
    "cveId": "CVE-2020-7192",
    "baseScore": "8.8",
    "vectorString": "AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Hewlett Packard Enterprise",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Hewlett Packard Enterprise Intelligent Management Center. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\nThe specific flaw exists within the handling of the beanName parameter provided to the deviceThresholdConfig.xhtml endpoint. When parsing the beanName parameter, the process does not properly validate a user-supplied string before using it to render a page. An attacker can leverage this vulnerability to execute code in the context of SYSTEM.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n08/21/19 – ZDI reported the vulnerabilities to the vendor10/08/19 – ZDI requested acknowledgement10/08/19 – The vendor acknowledged and provided IDs12/12/19 – ZDI requested an update01/09/20 – The vendor communicated that they plan to address the issues in the next release01/09/20 – ZDI requested an ETA for the next release01/14/20 – ZDI requested an update01/22/20 – ZDI requested an update01/14/20 – ZDI notified the vendor of the intention to 0-day on 02/04/20\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2019-08-21 - Vulnerability reported to vendor\n2020-02-04 - Coordinated public release of advisory\n2021-03-02 - Advisory Updated",
    "credit": "Steven Seeley (mr_me) of Source Incite"
}