{
    "date": "May 19th, 2020",
    "title": "(0Day) Microsoft Windows WLAN Connection Profile Missing Authentication Privilege Escalation Vulnerability",
    "ID_1": "ZDI-20-666",
    "ID_2": "ZDI-CAN-10037",
    "cveId": "",
    "baseScore": "7.0",
    "vectorString": "AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "Microsoft",
    "products": "",
    "description": "This vulnerability allows local attackers to escalate privileges on affected installations of Microsoft Windows. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the handling of WLAN connection profiles. By creating a malicious profile, an attacker can disclose credentials for the machine account. An attacker can leverage this vulnerability to escalate privileges and execute code in the context of an administrator.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n01/21/20 – ZDI reported the vulnerability to the vendor and the vendor acknowledged01/23/20 – The vendor sent a MSRC case number01/28/20 – The vendor sent a differently encrypted mail that appeared to be a blank mail – but was, in fact, a decline04/29/20 – ZDI requested a status update04/30/20 – The vendor sent the decrypted content of the 01/28/20 mail indicating:“Microsoft has decided that it will not be fixing this vulnerability in the current version and we are closing this case.”04/30/20 – ZDI replied that we had missed the prior mail and asked if this is certain05/11/20 – The vendor replied to confirm “this one is not intended for immediate servicing”\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it.",
    "timeline": "2020-01-21 - Vulnerability reported to vendor\n2020-05-19 - Coordinated public release of advisory\n2020-07-20 - Advisory Updated",
    "credit": "Anonymous"
}