{
    "date": "January 2nd, 2020",
    "title": "(0Day) Microsoft Windows Media Player Mpeg Audio Codec Out-Of-Bounds Read Information Disclosure Vulnerability",
    "ID_1": "ZDI-20-001",
    "ID_2": "ZDI-CAN-8185",
    "cveId": "",
    "baseScore": "4.3",
    "vectorString": "AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
    "vendors": "Microsoft",
    "products": "",
    "description": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Windows Media Player. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the MPEG audio codec. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute code in the context of the current process.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with ZDI policies.\n\n08/13/2019 – ZDI disclosed the report to the vendor and the vendor acknowledged08/14/2019 – The vendor provided a case number08/27/2019 – The vendor provided an ‘in assessment’ status update08/29/2019 – The vendor notified the ZDI that they were not able to reproduce the report08/30/2019 – ZDI provided additional settings information09/03/2019 – The vendor notified the ZDI that they were not able to reproduce the report and requested an additional step09/04/2019 – ZDI posed clarifying questions09/12/2019 – The vendor replied09/17/2019 – ZDI provided a crash dump10/01/2019 – The vendor provided an ‘in development’ status update12/05/2019 - ZDI and the vendor had a call regarding this and other reports and ZDI was told to expect a rebuttal/no fix reply12/18/2019 – ZDI requested any available update12/23/2019 – The vendor advised the ZDI that the report does not meet the bar for servicing12/27/2019 - ZDI notified the vendor the intention to publish as 0-day\n\n-- Mitigation:Given the nature of the vulnerability the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2019-08-13 - Vulnerability reported to vendor\n2020-01-02 - Coordinated public release of advisory",
    "credit": "Hossein Lotfi of Trend Micro Zero Day Initiative"
}