{
    "date": "April 2nd, 2020",
    "title": "(0Day) Corel PaintShop Pro PSD File Parsing Out-Of-Bounds Write Remote Code Execution Vulnerability",
    "ID_1": "ZDI-20-357",
    "ID_2": "ZDI-CAN-9636",
    "cveId": "",
    "baseScore": "7.8",
    "vectorString": "AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
    "vendors": "",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Corel PaintShop Pro. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the processing of PSD files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated object. An attacker can leverage this vulnerability to execute code in the context of the current process.",
    "addtionnal_details": "This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n11/18/19 – ZDI reported the vulnerabilities to the vendor11/18/19 – The vendor acknowledged receipt and provided ticket #s12/04/19 – The vendor confirmed the issues were being looked at02/20/20 – ZDI requested a status update03/04/20 – ZDI requested a status update and notified of the intent of publishing the cases as 0-day03/17/20 – ZDI requested a status update and notified of the intent of publishing the cases as 0-day03/25/20 – ZDI notified of the intent of publishing the cases as 0-day on April 2nd\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.",
    "timeline": "2019-11-18 - Vulnerability reported to vendor\n2020-04-02 - Coordinated public release of advisory",
    "credit": "Mat Powell of Trend Micro Zero Day Initiative"
}