{
    "date": "September 21st, 2016",
    "title": "(0Day) Google Chrome Protocol Handler Logic Error Restrictions Bypass Vulnerability",
    "ID_1": "ZDI-16-526",
    "ID_2": "ZDI-CAN-3625",
    "cveId": "",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "Google",
    "products": "Chrome",
    "description": "    This vulnerability allows remote attackers to bypass restrictions on vulnerable installations of Google Chrome. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the handling of URIs with the chrome protocol handler. The issue lies in the failure to isolate JavaScript from interacting with privileged chrome URIs. An attacker can leverage this in conjunction with other vulnerabilities to execute code in the context of the current process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n03/17/2016 - ZDI disclosed the report to the vendor03/17/2016 - The vendor acknowledged that \"This is known behavior, we should reevaluate if this can be fixed / restricted in some manner.\"05/18/2016 - ZDI sent a follow-up inquiry to the vendor06/22/2016 - ZDI sent a follow-up inquiry to the vendor06/30/2016 - The vendor let ZDI know they were still discussing the case, whether to 'fix' or 'working as intended'Given this, ZDI granted an extension.08/25/2016 - ZDI notified the vendor of the intent to publish the report as 0-day08/29/2016 - ZDI got an ACK from the vendor and a inquiry as to our \"drop dead date\"08/30/2016 - ZDI replied that date as 09/19/2016\n\n-- Mitigation:Given the stated purpose of Google Chrome, and the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application to trusted sites.\n\n      ",
    "timeline": "2016-03-19 - Vulnerability reported to vendor\n2016-09-21 - Coordinated public release of advisory",
    "credit": "lokihardt"
}