{
    "date": "March 1st, 2012",
    "title": "IBM Tivoli Provisioning Manager Express for Software Distribution 4.1.1 Multiple Remote Code Execution Vulnerabilities",
    "ID_1": "ZDI-12-040",
    "ID_2": "ZDI-CAN-1328",
    "cveId": "CVE-2012-0198",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "IBM",
    "products": "Tivoli Provisioning Manager Express for Software Distribution",
    "description": "    IBM Tivoli Provisioning Manager soapServlet SOAP Message Printer.getPrinterAgentKey SQL Injection Vulnerability\nThis vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of IBM Tivoli Provisioning Manager Express for Software Distribution. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists due to improperly escaped user input for an SQL query in the SoapServlet servlet. The resulting SQL injection allows a remote attacker to read data from the database including the SHA1 160 bits encrypted admin password. With the admin account it is possible to upload file to the webserver and execute code under the SYSTEM account.\nIBM Tivoli Provisioning Manager Isig.isigCtl.1 ActiveX Control Remote Code Execution Vulnerability\nThis vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of IBM Tivoli Provisioning Manager Express 4.1.1 Isig.isigCtl.1 ActiveX Control. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within the way the ActiveX Control parses data supplied to the RunAndUploadFile function. The ActiveX control is used to create an Asset Information file for the local system to be uploaded to the IBM Tivoli Provisioning Manager Express Server. Due to an unsafe call to strcat it is possible to cause a stack buffer overflow allowing for remote code execution under the context of the current user.\nIBM Tivoli Provisioning Manager User.updateUserValue() SQL Injection Vulnerability\nThis vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of IBM Tivoli Provisioning Manager Express for Software Distribution. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists due to improperly escaped user input for an SQL query in the register.do servlet. The resulting SQL injection allows a remote attacker to update their account rights to an admin level. With the admin account it is possible to upload file to the webserver and execute code under the SYSTEM account.\nIBM Tivoli Provisioning Manager User.isExistingUser() SQL Injection Vulnerability\nThis vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of IBM Tivoli Provisioning Manager Express for Software Distribution. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists due to improperly escaped user input for an SQL query in the logon.do servlet. The resulting SQL injection allows a remote attacker to read data from the database including the SHA1 160 bits encrypted admin password. With the admin account it is possible to upload file to the webserver and execute code under the SYSTEM account.\nIBM Tivoli Provisioning Manager Asset.getHWKey() SQL Injection Vulnerability\nThis vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of IBM Tivoli Provisioning Manager Express for Software Distribution. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists due to improperly escaped user input for an SQL query in the CallHomeExec servlet. The resulting SQL injection allows a remote attacker to read data from the database including the SHA1 160 bits encrypted admin password. With the admin account it is possible to upload file to the webserver and execute code under the SYSTEM account.\nIBM Tivoli Provisioning Manager Asset.getMimeType() SQL Injection Vulnerability\nThis vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of IBM Tivoli Provisioning Manager Express for Software Distribution. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists due to improperly escaped user input for an SQL query in the getAttachment servlet. The resulting SQL injection allows a remote attacker to read data from the database including the SHA1 160 bits encrypted admin password. With the admin account it is possible to upload file to the webserver and execute code under the SYSTEM account.\n  ",
    "addtionnal_details": "IBM has issued an update to correct this vulnerability. More details can be found at:http://www-01.ibm.com/common/ssi/cgi-bin/ssialias?subtype=ca&infotype=an&appname=iSource&supplier=897&letternum=ENUS911-055",
    "timeline": "2011-08-24 - Vulnerability reported to vendor\n2012-03-01 - Coordinated public release of advisory",
    "credit": "Andrea Micalizzi aka rgod"
}