{
  "schema_version": "1.4.0",
  "id": "GHSA-qxj7-2x7w-3mpp",
  "modified": "2025-02-19T17:47:19Z",
  "published": "2025-02-19T17:47:19Z",
  "aliases": [
    "CVE-2025-26620"
  ],
  "summary": "Duende.AccessTokenManagement race condition when concurrently retrieving customized Client Credentials Access Tokens",
  "details": "### Summary\nDuende.AccessTokenManagement contains a race condition when requesting access tokens using the client credentials flow. Concurrent requests to obtain an access token using differing protocol parameters can return access tokens obtained with the wrong scope, resource indicator, or other protocol parameters. Such usage is somewhat atypical, and only a small percentage of users are likely to be affected.\n\n### Details\nDuende.AccessTokenManagement can request access tokens using the client credentials flow in several ways. In basic usage, the client credentials flow is configured once and the parameters do not vary. In more advanced situations, requests with varying protocol parameters may be made by calling specific overloads of these methods:\n\n- `HttpContext.GetClientAccessTokenAsync()`\n- `IClientCredentialsTokenManagementService.GetAccessTokenAsync()`\n\nThere are overloads of both of these methods that accept a `TokenRequestParameters` object that customizes token request parameters. However, concurrent requests with varying `TokenRequestParameters` will result in the same token for all concurrent calls.\n\n\n### Upgrading\nMost users can simply update the NuGet package to the latest version. Customizations of the `IClientCredentialsTokenCache` that derive from the default implementation (`DistributedClientCredentialsTokenCache`) will require a small code change, as its constructor was changed to add a dependency on the `ITokenRequestSynchronization` service. The synchronization service will need to be injected into the derived class and passed to the base constructor.\n\n### Impact\nThe impact of this vulnerability depends on how Duende.AccessTokenManagement is used and on the security architecture of the solution. Most users will not be vulnerable to this issue. More advanced users may run into this issue by calling the methods specified above with customized token request parameters. The impact of obtaining an access token with different than intended protocol parameters will vary depending on application logic, security architecture, and the authorization policy of the resource servers.\n\nThank you to **Michael Dimoudis** of **PageUp** for finding this issue and responsibly disclosing it!",
  "severity": [
    {
      "type": "CVSS_V4",
      "score": "CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:L/VI:L/VA:N/SC:L/SI:L/SA:N"
    }
  ],
  "affected": [
    {
      "package": {
        "ecosystem": "NuGet",
        "name": "Duende.AccessTokenManagement"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "3.2.0"
            }
          ]
        }
      ]
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/DuendeSoftware/foss/security/advisories/GHSA-qxj7-2x7w-3mpp"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-26620"
    },
    {
      "type": "WEB",
      "url": "https://github.com/DuendeSoftware/foss/commit/a33332ddec0ebf3c048ba85427e3c77d47c68dac"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/DuendeSoftware/foss"
    }
  ],
  "database_specific": {
    "cwe_ids": [
      "CWE-367"
    ],
    "severity": "MODERATE",
    "github_reviewed": true,
    "github_reviewed_at": "2025-02-19T17:47:19Z",
    "nvd_published_at": "2025-02-18T18:15:36Z"
  }
}