{
    "date": "December 18th, 2017",
    "title": "(0Day) Linksys WVBR0 User-Agent Command Injection Remote Code Execution Vulnerability",
    "ID_1": "ZDI-17-973",
    "ID_2": "ZDI-CAN-4892",
    "cveId": "CVE-2017-17411",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Linksys WVBR0. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the web management portal. The issue lies in the lack of proper validation of user data before executing a system call. An attacker could leverage this vulnerability to execute code with root privileges.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n06/14/17 - ZDI disclosed the report to the vendor09/14/17 - ZDI sent a follow-up to the vendor requesting a status update10/10/17 - ZDI sent a follow-up to the vendor requesting a status update11/20/17 - ZDI notified the vendor of the intent to release the 0-day report on 12/1212/18/17 - The vendor confirmed that WVB Firmware version number is 1.0.41, that the firmware is rolling out to customers now and they expect the firmware rollout to be completed by 12/20\n\n-- Mitigation:Fixed in firmware version number 1.0.41\n\nGiven the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.      ",
    "timeline": "2017-06-14 - Vulnerability reported to vendor\n2017-12-18 - Coordinated public release of advisory",
    "credit": "Ricky \"HeadlessZeke\" Lawshae"
}