{
    "date": "June 12th, 2017",
    "title": "(0Day) Schneider Electric U.motion Builder runscript Directory Traversal Information Disclosure Vulnerability",
    "ID_1": "ZDI-17-389",
    "ID_2": "ZDI-CAN-3584",
    "cveId": "",
    "baseScore": "5.0",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:N/A:N",
    "vendors": "Schneider Electric",
    "products": "",
    "description": "    This vulnerability allows remote attackers to exfiltrate arbitrary files on vulnerable installations of Schneider Electric U.motion Builder. Authentication is not required to exploit this vulnerability. \nThe specific flaw exists within runscript.php applet.  There is a directory traversal vulnerability in the processing of the 's' parameter of the applet.  An attacker can leverage this vulnerability to disclose files from the system.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n03/29/2016 - ZDI disclosed the vulnerability reports to ICS-CERT (with an expected 'due date' of 07/27/16).03/29/2016 - ICS-CERT acknowledged that they received them and \"sent them on to our contacts at Schneider Electric, and will keep you informed of their progress.  We are tracking these issues as ICS-VU-291195.\"08/24/2016 - ZDI sent a follow-up inquiry to ICS-CERT requesting the status.09/08/2016 - ICS-CERT replied requesting more information on one vulnerability report, but said of the others, \"they have successfully validated the rest of the vulnerability reports.  Unfortunately, they don't expect to have a patch ready until the end of this year.\" ICS-CERT suggested they would work with the vendor to try to bring this in.09/19/2016 - ZDI sent a follow-up inquiry to ICS-CERT asking if the vendor was anywhere closer.10/11/2016 - ZDI sent a follow-up inquiry to ICS-CERT asking if the vendor was anywhere closer and stressed potential 0-day.12/14/2016 - ZDI sent a follow-up inquiry to ICS-CERT requesting the status.06/02/2017 - ZDI sent a follow-up inquiry to ICS-CERT requesting the status.\n\n-- Mitigation:\n\nGiven the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n      ",
    "timeline": "2016-04-04 - Vulnerability reported to vendor\n2017-06-12 - Coordinated public release of advisory",
    "credit": "rgod"
}