{
    "date": "August 7th, 2017",
    "title": "(0Day) Advantech WebAccess RtspVapgDecoderNew2 SetPaybackFilePath Stack-based Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-17-549",
    "ID_2": "ZDI-CAN-4068",
    "cveId": "",
    "baseScore": "7.5",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
    "vendors": "Advantech",
    "products": "WebAccess",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Advantech WebAccess. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within RtspVapgDecoderNew2.dll. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer. An attacker can leverage this vulnerability to execute arbitrary code under the context of the process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n11/08/2016, 11/09/2016, 11/10/2016 and 11/15/2016 - ZDI disclosed the reports, 44 in all, to ICS-CERT11/09/2016 - The vendor acknowledged receipt of the report through ICS-CERT and ICS-CERT provided ICS-VU-71410304/27/2017 - ICS-CERT notified ZDI these might be fixed in the latest version and asked would ZDI re-test05/03/2017 - ZDI replied that we cannot do the testing for AdvantechICS-CERT did not respond06/23/2017 - ZDI wrote to ICS-CERT requesting any available update07/31/2017 - ZDI wrote to ICS-CERT requesting any available update08/01/2017 - ZDI wrote to ICS-CERT advising of the intent to 0-day\n\n-- Mitigation:The killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibility Flags DWORD within the following location in the registry:\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\73888E2B-FF04-416c-8847-984D7FC4507F\n\nIf the Compatibility Flags value is set to 0x00000400, the control can no longer be instantiated inside the browser.For more information, please see: http://support.microsoft.com/kb/240797      ",
    "timeline": "2016-11-08 - Vulnerability reported to vendor\n2017-08-07 - Coordinated public release of advisory",
    "credit": "Anonymous"
}