{
    "date": "June 21st, 2017",
    "title": "(0Day) Lepide LepideAuditor Suite Malicious Server Command Injection Remote Code Execution Vulnerability",
    "ID_1": "ZDI-17-440",
    "ID_2": "ZDI-CAN-3833",
    "cveId": "",
    "baseScore": "9.3",
    "vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
    "vendors": "Lepide",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Lepide LepideAuditor Suite. Authentication is not required to exploit this vulnerability. \nThe specific flaw exists within genratereports.php. The issue lies in the failure to properly validate a user-supplied command  prior to using it in system calls.  The more general flaw is that the software trusts responses from a server that is specified by a user and can be induced to execute commands from that server. An attacker can leverage this vulnerability to execute arbitrary code under the context of SYSTEM.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n07/01/2016 - ZDI reported the vulnerability to a previous known contact with this vendor05/12/2017 - ZDI sent follow-up to the vendor06/02/2017 - ZDI sent follow-up to the vendor\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.\n\n      ",
    "timeline": "2016-07-01 - Vulnerability reported to vendor\n2017-06-21 - Coordinated public release of advisory",
    "credit": "Steven Seeley of Source Incite"
}