{
    "date": "August 7th, 2017",
    "title": "(0Day) Eaton ELCSoft Project File Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability",
    "ID_1": "ZDI-17-519",
    "ID_2": "ZDI-CAN-3960",
    "cveId": "",
    "baseScore": "6.8",
    "vectorString": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
    "vendors": "",
    "products": "",
    "description": "    This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Eaton ELCSoft. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within processing of EPC files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to execute arbitrary code in the context of the process.\n  ",
    "addtionnal_details": "        This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 120 day deadline.\n\n09/08/2016 - ZDI disclosed the report to ICS-CERT09/19/2016 - The vendor acknowledged receipt of the report through ICS-CERT and ICS-CERT provided ICS-VU-17065611/01/2016 - The vendor requested additional details from ZDI through ICS-CERT11/07/2016 - ZDI provided additional details as requested03/13/2017, 03/17/2017, and 03/29/2017 - ICS-CERT replied that the vendor cannot validate these on the latest and asked if ZDI could re-vet against their latest version04/05/2017 - ZDI replied that this report still hits07/12/2017 - ZDI requested an update from ICS-CERT07/13/2017 - ICS-CERT indicated that to their knowledge the vendor has not yet created a relevant patch07/20/2017 - ZDI notified the vendor of the intention to publish the report as 0-day\n\n-- Mitigation:Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the service to trusted machines. Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it. This could be accomplished in a number of ways, most notably with firewall rules/whitelisting. These features are available in the native Windows Firewall, as described in http://technet.microsoft.com/en-us/library/cc725770%28WS.10%29.aspx and numerous other Microsoft Knowledge Base articles.      ",
    "timeline": "2016-09-08 - Vulnerability reported to vendor\n2017-08-07 - Coordinated public release of advisory",
    "credit": "Ariele Caltabiano (kimiya)"
}