{
    "date": "February 28th, 2011",
    "title": "(0Day) Cisco Secure Desktop CSDWebInstaller Remote Code Execution Vulnerability",
    "ID_1": "ZDI-11-091",
    "ID_2": "ZDI-CAN-861",
    "cveId": "CVE-2011-0926",
    "baseScore": "9.0",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:C",
    "vendors": "Cisco",
    "products": "Secure Desktop",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Cisco Secure Desktop. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\nThe specific flaw exists within CSDWebInstaller.ocx ActiveX control. The vulnerable Cisco-signed ActiveX control verifies the signing authority names in the certificate chain but fails to properly verify the digital signature of an executable file that is downloaded and executed by the Cisco Secure Desktop installation process. A remote attacker can exploit this vulnerability to execute arbitrary code under the context of the browser.",
    "addtionnal_details": "February 28, 2011 Vendor provided:http://tools.cisco.com/security/center/viewAlert.x?alertId=22529---February 23, 2011 - This vulnerability is being disclosed publiclywithout a patch in accordance with the ZDI 180 day deadline.\n\n-- Mitigations:Cisco states that they will have a patch for this issue on March 31st, 2011. In the meantime, we suggest users implement the mitigations below.\n\nThe killbit can be set on this control to disable scripting within Internet Explorer by modifying the data value of the Compatibilty Flags DWORD within the following location in the registry:\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveXCompatibility\\705EC6D4-B138-4079-A307-EF13E4889A82\n\nIf the Compatibility Flags value is set to 0x00000400 the control can no longer be instantiated inside the browser. For more information, please see: http://support.microsoft.com/kb/240797",
    "timeline": "2010-09-14 - Vulnerability reported to vendor\n2011-02-28 - Coordinated public release of advisory",
    "credit": "Anonymous"
}