{
    "date": "March 2nd, 2011",
    "title": "PostgreSQL Plus Advanced Server DBA Management Server Remote Authentication Bypass Vulnerability",
    "ID_1": "ZDI-11-102",
    "ID_2": "ZDI-CAN-996",
    "cveId": "",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Postgres",
    "products": "Plus SQL ",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Postgres Plus Advanced Server DBA Management Server. Authentication is not required to exploit this vulnerability. \nThe flaw exists within the DBA Management Server component which listens by default on TCP ports 9000 and 9363. When handling client authentication the server does not properly enforce restrictions on accessing the jmx-console or web-console directly. These consoles allow arbitrary instantiation of classes. A remote attacker can exploit this vulnerability to execute arbitrary code under the context of the server.",
    "addtionnal_details": "Postgres\n\nSUBJECT: EnterpriseDB Technical Alert for Postgres Plus Advanced Server (DBA Management Server - Build 39) #20110209.01\n\nTECHNICAL ALERT STATUS========================\n\nStatus: Critical\n\nCritical - this update fixes a potential security threat, a possible data corruption, calculation, search set, or other function that may lead to inaccurate results. The update should be applied at the earliest possible time as it may affect a large number of users.\n\nRecommended - this update fixes non-critical issues that may impede general usage and require undesirable work-arounds affecting a limited number of users. The update is recommended to be applied when convenient.\n\nInformational - this update is informational only for non-critical issues. No software update or patch needs to be applied and issues may be addressed in the field using the specified version currently installed.\n\nWHAT IS IN THIS ALERT=====================This Technical Alert is notifying you of a software update that addresses the DBA Management Server module shipped with Postgres Plus Advanced Server v8.4 (8.4.x.x).\n\nThe software update contains the fix for a vulnerability that allows remote attackers to execute arbitrary code on vulnerable installations of Postgres Plus Advanced Server v8.4 DBA Management Server. The flaw existed due to a management feature in JBoss - the application server used by DBA Management Server. The default JBoss configuration does not properly enforce restrictions on accessing the jmx-console or web-console directly, when handling client authentication to the server. These consoles allow arbitrary instantiation of classes. A remote attacker can exploit this vulnerability to execute arbitrary code under the context of the server.\n\nJBoss provides a mechanism to restrict access to these resources, which has been used to fix this vulnerability.\n\nThis update only updates the DBA Management Server files (Build 39). The core database server engine version remains unchanged.\n\nACKNOWLEDGEMENT===================Discovery of this vulnerability is credited to AbdulAziz Hariri and TippingPoints Zero Day Initiative.\n\nIS THIS ALERT FOR ME?====================This alert is for customers using:\n\n- Postgres Plus Advanced Server version: 8.4.x.x- DBA Management Server\n\nHOW TO GET THE UPDATE AND APPLY IT==================================\n\nThis update is available through the Postgres Plus Advanced Server - StackBuilder Plus Module only.\n\nPlease perform the following steps in order to update your DBA Management Server for Postgres Plus Advanced Server. It is recommended that you backup your files before performing the upgrade.\n\n1. Right-Click on the System tray icon (PostgreSQL Elephant) and select 'Install Updates'.ORRun StackBuilder Plus directly from the Application Menu. The update will automatically be selected and displayed in bold.\n\n2. Click Next and choose the download directory (where the update will be downloaded).\n\n3. The installation program will start once the download is complete.\n\nHOW TO RESTORE THE ORIGINAL VERSION===================================\n\nIn order to restore to the original version, run the PPAS 8.4 SP1 (8.4.5.18) meta-installer and select only the DBA Management Server in the component selection screen. This will restore the component to Build38.\n\nTROUBLESHOOTING=================\n\nIf you experience any problems applying the upgrade or restoring the old version after applying the upgrade, please contact Technical Support at:\n\nEmail: support@enterprisedb.comPhone: +1-732-331-1320 or 1-800-235-5891 (US Only)Submit a Support ticket at: http://www.enterprisedb.com/products/support/overview",
    "timeline": "2011-01-04 - Vulnerability reported to vendor\n2011-03-02 - Coordinated public release of advisory",
    "credit": "AbdulAziz Hariri"
}