{
    "date": "February 3rd, 2011",
    "title": "BMC Perform Agent Service Daemon BGS_MULTIPLE_READS Remote Code Execution Vulnerability",
    "ID_1": "ZDI-11-039",
    "ID_2": "ZDI-CAN-613",
    "cveId": "",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "BMC Software",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of BMC Perform Agent. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the service daemon which listens by default on TCP port 6768. When processing the BGS_MULTIPLE_READS commands a user-supplied length value is trusted and utilized in reading arbitrary data into a stack buffer. By providing large enough values a remote attacker can abuse this to execute remote code under the context of the SYSTEM user.",
    "addtionnal_details": "BMC Performance Assurance for ServersVersions 7.4.00, 7.4.10, 7.4.15, 7.5.00, 7.5.10 January, 2011 Tracking number QM001683974: Potential vulnerability in network-accessible binary Service Daemon and Manager Daemon\n\nBMC Software is alerting users of the following products to a potential problem:- BMC Performance Analysis for Servers, versions 7.4.00 through 7.5.10- BMC Performance Assurance for Servers, versions 7.4.00 through 7.5.10- BMC Performance Assurance for Virtual Servers, versions 7.4.00 through 7.5.10- BMC Performance Analyzer for Servers, versions 7.4.00 through 7.5.10- BMC Performance Predictor for Servers, versions 7.4.00 through 7.5.10- BMC Capacity Management Essentials 1.2.00 (7.4.15)\n\nThis technical bulletin describes a patch that prevents the problem from occurring. If you have any questions about the problem or the patch, contact BMC Software Customer Support at 800 537 1813 (United States or Canada) or call your local support center.\n\nBMC Software thanks Manuel Santamarina-Suarez, of the TippingPoint Zero Day Initiative (ZDI), for reporting this issue.\n\nPotential vulnerability in network accessible binaries Service Daemon and Manager Daemon \n\nBMC Software has identified a potential security exposure in Perform binaries Service Daemon and Manager Daemon, which listen on a network port. (The default port is 6768.) This problem affects all supported versions of these products. \n\nThis is a remotely exploitable memory corruption that can result in the remote execution of arbitrary code such as the Perform Installation Owner account on UNIX, or the SYSTEM account on Windows.\n\nYou can correct this issue by downloading and applying the appropriate patch for your operating system and version of these products.",
    "timeline": "2009-10-27 - Vulnerability reported to vendor\n2011-02-03 - Coordinated public release of advisory",
    "credit": "Manuel Santamarina-Suarez"
}