{
    "date": "July 28th, 2011",
    "title": "(0Day) FlexNet License Server Manager lmadmin Remote Code Execution Vulnerability",
    "ID_1": "ZDI-11-244",
    "ID_2": "ZDI-CAN-1076",
    "cveId": "",
    "baseScore": "9.0",
    "vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:C",
    "vendors": "Flexera Software",
    "products": "FlexNet License Server Manager",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Flexera Software Flexnet License Server Manager. Authentication is not required to exploit this vulnerability.\nThe flaw exists within the lmadmin and lmgrd components which listen by default on TCP port 27000 (this can vary however if the port is in use). When handling a packet type having the opcode 0x2f the process trusts a user provided value when calculating the bytes remaining in the packet. Using this tainted remaining length value the process then copies packet data into a buffer on the heap. A remote attacker can exploit this vulnerability to execute arbitrary code under the context of the lmadmin user.",
    "addtionnal_details": "[August 12, 2011] - Vendor publicly issued patch:http://www.flexerasoftware.com/pl/12982.htm\n\n[July 28, 2011] - This vulnerability is being disclosed publicly without a patch in accordance with the ZDI 180 day deadline.\n\nMitigation supplied by vendor:This report has been entered into Flexera Softwares technical support case tracking system as IOC-000086525. The FlexNet License Server Manager components (lmgrd, lmadmin, and each vendor daemon) are only intended to be deployed in networks that are controlled by the recipient of FlexNet-enabled software. In particular, they are not intended to be deployed on the internet or in a public cloud. Flexera Software acknowledges that the deployment environments available to the FlexNet License Server Manager components are increasing and Flexera Software is considering supporting new deployment environments for these components in future releases of its products.",
    "timeline": "2011-01-24 - Vulnerability reported to vendor\n2011-07-28 - Coordinated public release of advisory",
    "credit": "Luigi Auriemma"
}