{
    "date": "November 9th, 2010",
    "title": "Novell Groupwise GWPOA HTTP Request Remote Code Execution Vulnerability",
    "ID_1": "ZDI-10-247",
    "ID_2": "ZDI-CAN-770",
    "cveId": "",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Novell",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Novell Groupwise. Authentication is not required to exploit this vulnerability. \nThe specific flaw exists in a function responsible for assembling an HTTP response. The following modules implement this functionality: gwpoa.exe, gwmta.exe, gwia.exe. When responding to an HTTP request sent to TCP port 7101 or 7100 or in the case of gwia.exe the user configured \"Message Transfer Port\", the process uses the client-specified \"Host: \" header to create an HTTP 301 redirection message. Within this code a local stack buffer is used to store the redirect location and can be overflown with a sufficiently long header value. A remote attacker can exploit this vulnerability to execute arbitrary code under the context of the SYSTEM user.",
    "addtionnal_details": "Linux - http://download.novell.com/Download?buildid=04oMMaiI9nI~NetWare/Windows - http://download.novell.com/Download?buildid=aq06Eoy7rf4~\n\nThe HTTP interfaces for the GroupWise agents (Message Transfer Agent, Post Office Agent, Internet Agent, WebAccess Agent, Monitor Agent) are vulnerable to an exploit that could allow a remote attacker to execute arbitrary code on vulnerable installations of Novell Groupwise. Authentication is not required to exploit this vulnerability.Affected versions:GroupWise 8.0x, 8.01x, 8.02. Previous versions of GroupWise are likely also vulnerable but are no longer supported. Customers on earlier versions of GroupWise should, at a minimum, upgrade their GroupWise systems to version 8.02HP (or disable the GroupWise Agents' HTTP interfaces) in order to secure their system.This vulnerability was discovered and reported by Anonymous working with TippingPoint's Zero Day Initiative (http://www.zerodayinitiative.com), ZDI-CAN-770Novell bug 627942, CVE number pendingRelated TID: http://www.novell.com/support/search.do?usemicrosite=true&searchString=7007159",
    "timeline": "2010-06-10 - Vulnerability reported to vendor\n2010-11-09 - Coordinated public release of advisory",
    "credit": "Anonymous"
}