{
    "date": "November 8th, 2010",
    "title": "Novell GroupWise Internet Agent RRULE Parsing Remote Code Execution Vulnerability",
    "ID_1": "ZDI-10-239",
    "ID_2": "ZDI-CAN-960",
    "cveId": "",
    "baseScore": "10.0",
    "vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
    "vendors": "Novell",
    "products": "",
    "description": "This vulnerability allows remote attackers to execute arbitrary code on vulnerable installations of Novell GroupWise. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the gwwww1.dll module responsible for parsing VCALENDAR data within e-mail messages. When the code encounters a RRULE variable it allocates memory for 0x800 bytes for the variable's contents, a list of numbers. It then proceeds to copy the numbers from the request while there are numbers to parse. By specifying a large amount of comma-separated values within an RRULE, an attacker can overflow the buffer and execute arbitrary code under the context of the SYSTEM user.",
    "addtionnal_details": "Linux - http://download.novell.com/Download?buildid=04oMMaiI9nI~NetWare/Windows - http://download.novell.com/Download?buildid=aq06Eoy7rf4~\n\nThe GroupWise Internet Agent (GWIA) has multiple vulnerabilities in the way that it parses variables within a received VCALENDAR message, which could potentially allow an unauthenticated remote attacker to execute arbitrary code on vulnerable installations of GWIA.Affected versions: GroupWise 8.0x, 8.01x, 8.02. Previous versions of GroupWise are likely also vulnerable but are no longer supported. Customers on earlier versions of GroupWise should, at a minimum, upgrade their GWIAs and associated Domains to version 8.02HP in order to secure their system.These vulnerabilities were discovered and reported by Anonymous working with TippingPoint's Zero Day Initiative (http://www.zerodayinitiative.com), ZDI-CAN-954,ZDI-CAN-960, ZDI-CAN-961Novell bugs 642339, 642345, 642349, CVE numbers pendingRelated TID: http://www.novell.com/support/search.do?usemicrosite=true&searchString=7007155",
    "timeline": "2010-09-24 - Vulnerability reported to vendor\n2010-11-08 - Coordinated public release of advisory",
    "credit": "Anonymous"
}