{
    "date": "July 29th, 2024",
    "title": "(0Day) AVG AntiVirus Free icarus Arbitrary File Creation Denial of Service Vulnerability",
    "ID_1": "ZDI-24-1009",
    "ID_2": "ZDI-CAN-22942",
    "cveId": "CVE-2024-7236",
    "baseScore": "5.3",
    "vectorString": "AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:L/A:H",
    "vendors": "",
    "products": "AntiVirus Free",
    "description": "This vulnerability allows local attackers to create a denial-of-service condition on affected installations of AVG AntiVirus Free. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the AVG Installer. By creating a symbolic link, an attacker can abuse the update functionality to create a file. An attacker can leverage this vulnerability to create a persistent denial-of-service condition on the system.",
    "addtionnal_details": "02/22/24 – ZDI submitted the vulnerability via GenDigital’s webform to be managed by a third-party Vulnerability Disclosure program02/29/24 – The third-party Vulnerability Disclosure program confirmed the reported behavior04/03/24 – ZDI asked for updates06/26/24 – ZDI informed the vendor that since we’ve not received a response that we will publish the case as a zero-day advisory07/03/24 – The vendor communicated that the issue was not fixed and requested an extension07/11/24 – ZDI requested an estimated release date07/19/24 – The vendor confirmed that the issue was being investigated07/26/24 – ZDI notified the vendor of the intention to publish the cases as 0-day advisory on 07/29/24\n\n-- Mitigation: Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2024-02-22 - Vulnerability reported to vendor\n2024-07-29 - Coordinated public release of advisory\n2024-07-29 - Advisory Updated",
    "credit": "Nicholas Zubrisky (@NZubrisky) and Michael DePlante (@izobashi) of Trend Micro's Zero Day Initiative"
}