{
    "date": "June 13th, 2024",
    "title": "(0Day) Deep Sea Electronics DSE855 Configuration Backup Missing Authentication Information Disclosure Vulnerability",
    "ID_1": "ZDI-24-671",
    "ID_2": "ZDI-CAN-22679",
    "cveId": "CVE-2024-5947",
    "baseScore": "6.5",
    "vectorString": "AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
    "vendors": "Deep Sea Electronics",
    "products": "DSE855",
    "description": "This vulnerability allows network-adjacent attackers to disclose sensitive information on affected installations of Deep Sea Electronics DSE855 devices. Authentication is not required to exploit this vulnerability.\nThe specific flaw exists within the web-based UI. The issue results from the lack of authentication prior to allowing access to functionality. An attacker can leverage this vulnerability to disclose stored credentials, leading to further compromise.",
    "addtionnal_details": "01/21/24 – ZDI requested a vendor PSIRT contact. \n\n01/22/24 – The vendor provided contact information.\n\n01/23/24 – ZDI reported the vulnerability to the vendor.  \n\n02/05/24 – The vendor states the report was blocked by IT and asked ZDI to resend the report.  \n\n02/12/24 – ZDI resent the report using an alternative method.\n\n02/13/24 – The vendor asked why we performed tests on their products.\n\n02/13/24 – ZDI provided the vendor with additional details about the ZDI program.\n\n02/14/24 – The vendor asked what initiated the ZDI to look at the DSE855.\n\n02/14/24 – ZDI emphasized our intent to responsibly disclose this vulnerability to Deep Sea for remediation. The ZDI also offered additional resources about coordinated vulnerability disclosure, as well as feedback on implementing a proper incident response process. We also reiterated our 120-day disclosure policy to ensure the vendor was aware they needed to respond with a patch within the allotted time. \n\n05/24/24 – ZDI informed the vendor that since we never received a response that we have assume this vulnerability remains unpatched, and that we’re publishing this case as a zero-day advisory on 06/13/24.  \n\n-- Mitigation: Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2024-01-23 - Vulnerability reported to vendor\n2024-06-13 - Coordinated public release of advisory",
    "credit": "Gjoko Krstic, Zero Science Lab"
}