{
    "date": "July 29th, 2024",
    "title": "(0Day) AVG AntiVirus Free AVGSvc Link Following Local Privilege Escalation Vulnerability",
    "ID_1": "ZDI-24-1008",
    "ID_2": "ZDI-CAN-22260",
    "cveId": "CVE-2024-7234",
    "baseScore": "7.8",
    "vectorString": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
    "vendors": "",
    "products": "AntiVirus Free",
    "description": "This vulnerability allows local attackers to escalate privileges on affected installations of AVG AntiVirus Free. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\nThe specific flaw exists within the AVG Service. By creating a symbolic link, an attacker can abuse the service to delete a file. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM.",
    "addtionnal_details": "11/01/23 – ZDI reported the vulnerability via AVG’s Security Reports email. 11/10/23 – ZDI asked AVG Support team for updates12/19/23 – AVG’s Support team advised ZDI to re-submit the report to GenDigital Information Security team12/29/23 – ZDI resubmitted the vulnerability to GenDigital Information Security team 01/10/24 – ZDI asked for updates01/15/24 – GenDigital Information Security team advised ZDI to submit the report via a webform to be managed by a third-party Vulnerability Disclosure program01/15/24 – ZDI resubmitted the vulnerability to the third-party Vulnerability Disclosure program01/17/24 – ZDI asked GenDigital Information Security team to confirm the receipt of the report04/03/24 – ZDI asked for updates06/26/24 – ZDI informed the vendor that since we’ve not received a response that we will publish the case as a zero-day advisory07/03/24 – The vendor communicated that the issue was fixed 07/11/24 – ZDI requested an estimated release date07/26/24 – ZDI notified the vendor of the intention to publish the cases as 0-day advisory on 07/29/24\n\n-- Mitigation: Given the nature of the vulnerability, the only salient mitigation strategy is to restrict interaction with the application.",
    "timeline": "2023-11-01 - Vulnerability reported to vendor\n2024-07-29 - Coordinated public release of advisory\n2024-07-29 - Advisory Updated",
    "credit": "Nicholas Zubrisky and Michael DePlante (@izobashi) of Trend Micro's Zero Day Initiative"
}